{"repair": ["Garmin is currently repairing my previous unit under warranty, even though I told them it was my fault.", "and that can be fixed by a &quot;repair&quot; button in windows.all in all it was worth the wait, and is very expandable.", "You'll pay all shipping costs for repairs and after the one-year warranty you're on your own.-The one good thing about this laptop was the DVD burner.", "Because it was a problem in the motherboard itself, the repair was quoted at $800+.", "When this one was repaired, HP also reformatted my hard disk, losing all my data again.", "Now they won't repair it anymore and effectively say \"you're on your own\".", "I took the unit apart and found it fairly well constructed (considering the plastic components), but could not repair the faulty receptacle.", "I've been doing PC repair for the last 10 years.", "Their answer? Send it back for repair.", "&lt;sigh> I repaired the first table with hardware that I had laying around and am still using both tables until I find something reasonable to replace them.", "The only way to fix it is to take it to an authorized repair center, or to send it into Toshiba.", "I repaired the left side and can get sound out of the left but no chance at sound out of the right because instead of breaking the solder or the contact, it tore the board.", "We sent the computer in to the warranty service and they \"repaired\" it.", "I took it to a little independent repair shop and they made a couple of adjustments and fixed it.", "But if you have to push it to turn it around or whatever, the handle automatically starts to collapse.Shipping to return it for repair is too much and I would be without a case for 1-2-3 weeks while they repair it.", "I have never mistreated this computer in any way that would cause damage to it, I even bought the $70 matching protective case to keep it safe!Sony's customer service is awful and there are no authorized repair services for sony laptops so you are pretty much forced into sending the computer out to San Diego to be repaired for two weeks.", "I took it apart to see if I could repair the connector but it wasn't possible.", "A local company provided us with a three-figure estimate for repair.", "Under the 1-year warranty I then sent the unit to HP's repair facility in Memphis, Tennessee, where they replaced the battery yet again, and shipped it back.", "Please ask around before you purchase this computer because unbeknownst to me Compaq (now HP) has apparently tried to reduce costs on notebooks and it shows!I will give it 2 stars because luckily it crashed within its warranty (unluckily 2 weeks before exams!) and the tech support people were helpful and I can send it for repairs for free.", "Why should you have to send a product in for repairs that you have only had for a few weeks? It is taking all my control not to take the thing outside and run it over with my car.", "Not their policy, I'm told and they dispute the 30 days, because they're not counting the days at the local repair depot before I started calling them directly.", "Since my iMac has been undergoing repairs, I've found myself using my iBook for extended periods of time at one sitting and this sucker gets hot! In the area left of the trackpad, it can get hot enough that it's simply uncomfortable to type and I worry that something's going to blow.That's when I started looking for a solution and found this cooler on Amazon.", "I'm looking at four repair tickets on a machine that frankly gets light use.", "Their warranty does NOT guarantee a computer that will EVER work -- only endless repair attempts.", "I performed several self repairs since I'm a certified tech.", "After putting in the new harddrive, the repair center called me and told me that the keyboard and mouse quit working.", "I was seriously considering buying only an ESD wrist strap to do needed repairs on a laptop when I discovered this kit.", "I sent it in for repairs through my local Apple store to Apple's repair facility in Texas.", "The bag was all I needed, but after a week's use, one of the straps tear off, so now I need to repair it.", "This way, I just pick up an 1/8\" coupler at Radio Shack (a $4.00 component), and a RCA-to-1/8\" connector cable (or just use the included adapter) and replace when necessary, barring the need for expensive return shipping on a laptop that needs no more repaired than to have a little metal contact replaced.Now, what I don't like is that the RCA jacks are not amped through the card like the 1/8\" headphone jack is on this device, making it much quieter, even with my laptop volume at it's loudest (hence the 4 stars).", "I put it through the repair cycle once and followed it with a cleaning cycle, as per the instructions.", "I had a family friend take a look at it and helped me repair it.", "Worked fine to transfer all data from the hard drive before sending my laptop in for repairs.", "$670 total.* Even though they were giving away their own profit, they told me that they thought it would be unethical to recommend that I repair it.The service center appealed to their Toshiba rep.", "By the 18th month, the hard-drive crashed completely - beyond repair.", "Shortly after Vista identified a series of GPU shutdowns, followed by being unable to boot into Vista.After getting a repair for $799 with Sony (covered by credit card extended warranty) that provided the same 8400M chip as a replacement, I realize I'm good for maybe another year and a half before I can expect a repeat experience.As for the notebook in use, my only complaint is the relatively low resolution of the screen compared to other units at this size.", "They repaired the dvd and said I didn't have to erase my programs after all.", "So I sent it for repair just before the warranty expired.", "I paid a lot of money for my Sony and I expected Sony to repair my computer without a fuss.That did not happen.", "Yet by observing these tips, you can probably make this or any laptop cooler last a long time, which in turn saves your hard-earned bucks from buying new stands, repairing laptops, and treating burns.*** Original Review (Nov 6, 2007) ***This is my first laptop cooling stand, and beforehand I've been using a 1-inch thick 3 ring binder as my laptop stand.", "This is a well made fantastic tool kit!I got this kit for my son who just started his own computer repair business.", "When a piece broke off one of the buds and Shure wanted $50 to repair it (plus tax and shipping), I went looking; the Etymotic ER6 got good reviews, and Amazon offered it at a great price, so I went for it.", "Yes its been in for repair twice.", "Apple's repair facility has had my notebook for more than four weeks now, and even after numerous phone calls to Apple's service center, I still don't have my notebook.", "also, sony customer service is terrible, i recommend getting 3 year onsite repair warranty unless you want to chance sitting on the phone with sony or waiting for repairs.", "The hard drive malfunctionedand the repair man said even new ones don't work, now that theyare not made in USA.", "I am a big fan of HP products, in spite of a recent teeth-gnashing experience of having a HP laptop repaired under warranty (a potpourri of poor communications from HP).", "You use a \"small\" Philips screwdriver (often included in a generic computer repair kit) to unscrew the 2 screws listed on the Dell website.", "What really bugs me is that whenever I call the support center the supposed \"expert\" has me go through repair steps I've done several times before I call them for help.", "I had it sent in multiple times because it wouldn't turn on because the power socket is easily damaged.List of repairs made:Three times to fix lack of poweronce for a broken screen (my brother threw it)my computer deleted the wireless card from the BIOS or something like thatonce for software repair because it wouldn't bootand now it won't turn on again.", "The repair, which should have been free, is going to cost $250.", "The notebook served several more years of use after being repaired, and has been passed on to a friend now.", "They reeived the pack and because they couldn't repair the pack, they sent us a brand new one.", "They were trying to charge me $795.00 to replace the LCD screen and would not do any repairs until I agreed to pay the $795.00 for the replacement of the LCD screen.", "(Sony, did not have a repair center or technician in the city where I was.", "At first this happened with my desktop- i was convinced my computer was broken- i spent $100 on repairs (I know I got ripped off here).", "At the time I purchased this laptop, my other laptop (an HP Pavilion ZX5240US) was in repair.", "Repaired it myself.", "I'd like to find a way to lubricate the fan and see if that helps, but it seems to be a closed unit.Toshiba sure doesn't make it easy to repair this unit, with almost no resources online for the overheating and fan problems that seem to be endemic to this computer, and it seems that it often needs some major repairs, particularly to the cooling.", "Now it's out of warranty, and Palm expects me to pay nearly $200 for a repair with a joke of a warranty.", "I have to constantly explain why I need a repair, for example, for some reason the VAIO logo on top of the lid burned through to my screen, even with a screensaver functioning; however, it is not replaceable under warranty from wear and tear but must be accidentaly dropped.", "As it was, the repairs and replacement parts cost me nothing.", "in order to get repaired, must 1] take to an \"authorized service center\" in the states or 2] they will send you a box you can ship it to them, but must pay $24 for the box. and they only partnered UPS. no UPS in Iraq and nearest repair shop in Kuwait,but not covered under \"international warranty.\"know of several other service members with this type of notebook that have had display or battery problems and now out of $1Kguaranteed to have problems if you buy this.", "Even if things don't work, one can get a refund in thirty days or have it repaired or replaced in the first year of warranty.", "I wrote to Sony, arguing that such a major fault was unacceptable, and asked them to repair the product at their own expense.", "Needless to say they did not send the detail.I sent the $1300+ laptop to an outside repair shop that replaced the motherboard for $300.", "Maybe I will when the new RW DVD's are proven and working faster than they do at the moment but otherwise I can see no reason to change from the 607.I cannot comment much on the official Toshiba backup except the one problem I had with a modem blowing up (I think the phone line got hit by lightning) was fixed by my local repair shop simply and efficiently.", "The only other thing they said I could do was set up a repair and wait till god only knows how long to get them back.", "After my Compaq Armada fried it's logic board, I had a doorstop that would cost more to repair than it was worth.", "I got acknowledgement in couple of days and after a few weeks I got the repaired part.", "I contacted Trager and they asked me to send it in for repair or replacement.", "It died one week after the warranty and there is no place to repair it even for $.", "I've sent in the notebook twice now to be repaired only to recieve it a week later.", "You don't want to have to pay for a repair.", "If you ask them again, then you will get some vague answers - \"you have to use reset button one in a week\".- They try to avoid any repair at Repair Center.", "We contact Toshiba - they refer us to a local firm that does their repairs for the entire South Texas region.", "I called Toshiba about my defective USB ports, they told me they would send me a box to have my laptop repaired in, then they didnt send anything.", "I do a lot of laptop repair and trouble shooting, and one of my clients had this old mac. well the screen didnt work and I wanted to make sure it was not the motherboard.", "thedunlapfamilyATcomcastDOTnet.EDIT: At this time (April 2009), this repair guide to which I just referred is still on the Internet.", "The best part was that I was able to do the installation in about 15 minutes once I figured out where the plug-in was located on the back of the radio (found a picture of the rear of the radio in my repair manual)!", "I'm a 22+ year veteran at building and repairing systems from Windows based pc's to macs and all flavors of laptops.", "They still tell me &quot;your only option is to have it repaired&quot;.There are difficulties reaching their helpline.", "I did so, but later had to call them repeatedly to find out what the repair status was (their online system for status checking service orders does NOT work), and wrangled with their phone support about getting them to call me once my machine had been examined and diagnosed.", "They subsequently told me they were unable to answer that question! They then advised me it would be best if i would send in the laptop, specifying any minor parts repair would be charged at $299 + tax, and major ones at $699 + tax! Incredible.", "They are based in CT and since it was a new headphone, barely broken in- I thought let me send it for repair and give it a try.", "Returned my laptop without any repair saying no problem found; must be a software issue.", "After contacting tech support (which is free for the first year) and unsuccessfully trying to re-format my hard drive with the included Restore Discs, I finally had to ship it off to Compaq to get it repaired (also free for the first year).", "I didn't take them up on the offer, nor will I be entrusting my laptop (back to normal now, after a $400+ repair) to a Targus product.Bottom line: I can't recommend this product to anybody.", "Sony made it easy to keep track of the progress of the repair online.", "Otherwise I could return it to them for repair.", "so relatively happy at this point, I didn't get too annoyed by the fact that the thing came back with Swedish OS (I don't speak swedish, have never lived in sweden, I live in France and the laptop was repaired in the UK!) so I had to re-install my old OS with a dictionary at hand, download all missing updates, re-install every single piece of software etc. loads of work..until I later realised something quite devastating as i was inserting my XD-memory card into the 6in1 media card reader that I had grown to love: the card just slipped into the computer-not into a card reader but fell into the laptop completely! I had a closer look and realised that there was no media card reader anymore on the laptop.", "Toshiba customer support/warranty repair department was helpful and handled things in an expedient fashion.", "I would get a error message saying I needed my cooling system repaired and then it would shut off.", "If not, any necessary warranty repairs would require mailing in the notebook and that could take a while.* Considering the high price (nearly $2000), I would've expected Sony to use slightly better components.", "USB Vacuum Cleaner/Hoover for Laptop PC Keyboard is the perfect accessory to every vertial office.A great equipment to save on GEEK repairs.", "My screen cracked when I moved the unit on my desk (a $699 repair).", "I did some research and found their own web site says this is a common problem and will not be repaired unless you bought some extra insurance when you purchased the product.", "I am not a computer geek but am fairly handy so I thought I would try the repair myself.", "A few days later I get this e-mail telling me the repairs would cost $279.99 so I contacted them that I had enclosed a copy of the reciept for purchase verification 4/25/2007."], "computer": ["Any other old and new computers I tried could read those disks without any problems.", "It was easy enough to install, it took like 10 minutes of reading, and 5 minutes of restarting my computer.", "This can be a handy troubleshooting feature.This USB port also has a DC power jack to power it if the connected devices draw too much power from the computer it is attached to, however it does not come with a DC power supply, but so far I have not required one.It's a great buy ... you will not go wrong by getting one ... or two!", "But I use this for hours each day and have transported it many times in my computer bag--the cooler's slim design makes it conventient for transporting in the bag.", "Thinking that it was my own computer's error I scouted for other OS installation discs - Ubuntu, Windows XP SP2.", "In the rest of the backpack I carry:~ Motion Computing LE1600 tablet PC with an extra battery, and an external CDR/DVD drive (this all fits in the laptop compartment.)~ Canon SD630 (my compact poin-and-shoot camera, which fits in the external zippered pocket.)~ Memory card wallet, card reader, extra camera batteries, writing pad, pens, various cables, lens caps, headphones, cleaning cloths, mini tripod, camera remote, 3 enclosed laptop hardrives - all of which fit in the main compartment.Even with all of that gear, I can still manage to cram a small lunch into the backpack on days when I ride my motorcycle to work!The straps are well padded, and have the loops that allow you to attach other Lowepro accessory pouches.", "Here was the original goal plain and simple: record my bass tracks on my computer using either CoolEdit or Audacity.", "Anyway I have been building computers for a decade now, and I LOVE this lil computer...GET ONE :)", "I quickly learned that the Zune software is pretty much the same thing as itunes as it syncs itself with the content of your computer.", "I work on and with computers for a living on a day-to-day basis, and I must say this is probably the best $3x.xx I have spent.", "I needed DVD's to back-up my new Laptop Computer, and the DVD's that I got from Radio Shack did not work(OK, I got the cheap Radio Shack brand... my mistake).", "iDisk is also useful because it allows you to create pages where others can download files from your iDisk, serves as a safe backup for items on your computer and it makes great general storage space! I haven't used the other features so I won't rate them.", "NOTE: That Laptop can actually be any computer.", "I guess the Japanese manufacturer was the same one that built the control systems for the Fukushima Daishi power plant.:(_____________________________My T-60, recently upgraded to Windows 7, now has a smooth, streamlined connection to all my peripherals and the Web.This docking station is exactly as big as it \"has to be,\" and is loaded with USB ports, video and audio output connections, and even has room to add an optical drive if I need that.Arrived timely and as-advertised; one \"snap\" and my ThinkPad now gives me the capabilities of a desktop computer (plus).I am using this docking station as I type this review.", "Support asked me to connect the WAP to my laptop computer directly using an ethernet cable.They had me configure the TCP/IP v4 to the address 192.168.1.50 and then I was able to get to the config screens.", "taking my computer out at airport security no longer scares me; they almost always let me leave in in the sleeve as long as it's in a separate bin.it preserves the main advantage of a laptop-its portability-because it fits snugly around my mac and doesn't add bulk or weight.", "I was pleased that a crossover cable was not needed, since I didn't have one.I found the following process to work, which requires you have Opera installed and the print server plugged into your computer's ethernet port:1.", "I'm a new law student, so I take my computer with me to school everyday, and this sleeve is just perfect.", "But computing with a pen takes some time, and I think that everyone could benefit from it.", "I started with a computer (a laptop) connected to a cable modem and a printer connected to the computer.", "My computer knowledge is limited to just having owned one (four different ones)for the last 13 years.", "Besides the fact that the computer has a life span of two months, it freezes more than any PC I have ever used.", "Sometimes I wouldn't notice in time and my computer would go into \"hibernate\" because of low battery.", "However, after updating the drivers, toiling with every setting I could, and troubleshooting using another computer I could never get past the distortions in fidelity and color.", "This display is more consistent with computer displays and HDTV.", "I was worried this protection pad would not work on my computer since I don't have the brand new MacBook Pro, but it fits perfectly.", "I bought this specifically to use in my truck and or travel trailer to recharge a small laptop computer, camera batteries, handheld CB radio and later a small handheld vacuum.", "I probably wouldn't use them for a laptop or computer, but they are perfect for my little MP3 player and work great.", "I bought it for some casual gaming on the family computer and fell in love with it.", "I even tried loading on another computer, which was just upgraded with Adobe, and still can't read it.", "I definitely recommend this back pack to anyone who has a computer, and a lot of books.", "My advice is that you have a single computer set up and you're looking for an attractive and quality keyboard, then this is the product for you.", "I use the linksys router on my laptop on a 32 computer network.", "AND the antenae has been found at the bottom of my computer bag on more than one occasion.", "It should be able to handle at least 2GB.Summary:For the performance and the price I paid for this computer (around $900), I consider this is a very good deal.", "Now we cannot get his laptop off his desk, which defeats the purpose of having a portable computer.", "I put the computer in, they picked it up, and I receive the computer back the next evening, with a new motherboard.", "Low and behold, GlidePoint installed and worked fine (except the gestures because this was a used model I purchased from another site.So in short, this may work for you in other capacities, but if you are in the small minority of people that use one of their touch pads and wish to 'enhance' it with GlidePoint, make sure you get either the USB or PS/2 type that connect the touch pad directly to your computer so as to bypass this adapter altogether.I can't be too mad because it was an impulse buy done without prior research on my part, but in my mind if a company makes both the device and the adapter, it should know about and correct usage errors between the two.", "The video sharing program must install on the host computer.", "When you start up your computer it works well if you plan to use Live Call or Messenger.", "Then one of the fans stopped working and the whole thing would just get so hot from the computer it wouldn't even matter it was there.", "Each time I turned that feature on while using Antivirus, my computer gave me the BSOD and performed an immediate and hard shutdown.", "It will wake back up right away when you want to access it.The drive also monitors the pc and knows when you turn off your computer.", "One star, since you can roll it up and take it with you, but totally worthless as a computer keyboard.NOTE: Both paragraphs say the exact same thing.", "That wouldn't be bad for a desktop computer or even a laptop that only needs a headset when the laptop is kept in a single place, but for me that's a bit bulky and cumbersome since I like to move around the house with shows/music a lot when I'm doing housework.", "I recovered the computer and avoided the Interactual player.", "In my case, I was disassembling a laptop, so some of the tools cannot be used because only desktop computers require them.", "Also, 128 MB of RAM is downright puny in today's computing world.", "I've owned this computer for 2.5 years and it is perfect for my computing needs from a laptop.", "I have purchased two of these, one for an office computer and another for an older laptop, both of which had lost their onboard ethernet.", "I bought the XL version of this bag back for my 17\" Mac notebook five (maybe more?) years ago, and I've been very happy both with the bag itself and with the service from BBP.I often carry quite a bit in the bag, both in terms of computer equipment and books/papers/whatnot.", "My computer recognized the USB device, but the updater (RioNitrusFlash_123.exe) said that the operation timed out.", "Finally, I hooked up a nice powered subwoofer to the RCA outs which gives me MASSIVE bass and sound rivaling my stereo system downstairs (not quite, but still better than any wimpy sub/sat setup made for computers).", "I have been using the WG111T to obtain drivers in order to get the 802.11 cards working on used laptop computers that came with erased hard drives (after reinstalling the licensed OS - Win2K).", "Now the computer works just fine for surfing etc with anti-virus running.", "That continued to fail, and the computer continued to request new drivers.", "It is designed to be a small case for carrying the computer and a few accessories.", "This product was exactly what I was looking for as a gift for my daughter who had recently purchased a 17\" laptop computer.", "I did not use it for few months and then tried to use on my home computer.", "Second, the router signal worked great when i was using my laptop on the same floor the router was located, but when i took my computer upstairs (1 floor) the signal was on and off, and sometimes would accept my password.", "In any case, it's under my desk with the rest of my ugly power bricks so it's not really that big an issue.Nuts and bolts:The speaker set comes with a power brick, a stereo male/male 1/8 inch miniplug with about 6 ft of run to run to your computer.", "Anyway, it works better than the other two computers in the house, which have faster processors and one of them is newer.", "This memory change made a 3 year old computer work GREAT again and it now has 4 times the RAM as before.", "This product definitely keeps my computer cooler and notice that my computer is much hotter when not using it.", "If I want to plug my ipod into another computer to get a file, then I should be able to do it plain and simple without the Apple police out to shut me down every time.", "The fan is the only thing keeping this computer from melting.This is no joke.", "I purchased a SONY VAIO VGN-NW265F laptop computer on Black Friday 2009 which has turned out to be as close to perfect as possible.", "Unlike XP, there are never unavailable options because of your incompatible hardware, and best of all: no baloon info! When was the last time a PC user actually needed to be reminded that they had just removed their Usb Key??? Or, in case of a re-install of XP which i did more often than not, Usually an hour or so is spent making sure the OS worked with the computer as best as possible.", "For example, if you have a main LAN in one part of your house or office, and at the other end of the house/office you have a bunch of computers, printers, etc., some of which are wired together with a hub/switch and some of which are wireless (that is, you'd like to be able to take your wireless laptop around the office as you see fit, without having to be hardwired in the far part of the office), then you'll have to buy 2 of these WAP11 ver2.6 devices to put in the far office: one in Mode 2 and one in Mode 5 (which is still cheaper than stringing cable through the walls!!).I hope the above makes sense because I'm not going to scroll up to edit it.", "After the 3 hours of time spent with several technicians it is clear they are reading off a script and going down the line of problems and don't know what they are doing.UPDATE: We contacted Linksys in CA (not an easy task) and have recieved several phone calls...one apologizing for the rudeness of the technician and another from a CA tech trying to help us fix our computer.", "ALTHOUGH I HAVE A BACKUP COMPUTER SYSTEM READY TO GO I HAVE NOT HAD TO ACTIVATE IT .", "I am switching to a tethered computer, from laptops, for the first time in 8-9 years, and have long ago come to prefer touchpads to mice.This touchpad, unfortunately, comes with no drivers.", "The one side of the bag the computer tucks into a thick but not too-heavy padding, a padded top folds over it and a Velcro strap holds the top shut and the computer securely in place.", "To run WPA you must download the WPA patch on all computers associated with your devices.", "I was looking for a way to protect my laptop in that bag, rather than shop for a much more expensive dedicated computer bag.", "Then I connected the VGA/SVGA connectors to the computers' VGA/SVGA connectors, and plugged the remaining USB ports into the computers.As an aside: one added advantage to using the device is that the keyboard and mouse signals to the computers now take only one USB port on each computer leaving another port free for some other device.I didn't install the TRENDnet driver.", "My computer (Toshiba Satellite) wants the air to go UP from below, not down.", "The computer's fan went crazy every time i put it on this thing.", "Video looks great but if you are trying to work on your computer via your TV, this is not going to be an acceptable setup - again please keep in mind, you are converting a crisp clear VGA signal down to RCA cables... so you are going to lose a lot by nature of the technology.", "Download Windows Media Connect, It just runs better as your media server software and you can have it installed on multiple computers to access content.", "It is the size of a laptop keyboard (one without the number pad), and the footprint is only a couple inches less then a normal computer.", "I really like this mouse - enough to buy a second one for my workshop computer.", "That is always the downfall of the cheaper strip supressors.I read in a computer magazine a few years ago that the higher the number of joules, the better the protection.", "The cable is a bit thin, but really, who's going to bring a bolt cutters to steal a laptop? Its main purpose is to keep people from walking away with your computer.", "I did the same thing to my laptop and the same magic happened (I did not do any thing else, there was no need to set an IP address, no configuring the router, did not call tech support and no beating on a computer to get it to work).", "Now I am using it with my home computer and I have found that the side scrolling is a little slow to be useful.", "Do not waste your money on this if you use the computer for anything more than casual browsing (but then you wouldn't need a cooler in the first place)... invest in another cooler.", "The computer feels fast enough for most of my everyday tasks, which are web browsing, emailing, light photo editing, some gaming, some video editing and listening to music.", "I love the computer, but had the exact same problem buying from Circuit City.", "In addition, I tried to use this AP for *only* hard-wired connections (turning off all wireless devices at home), and over time (30 min or so) the hard-wired computer would lose its IP address over DHCP, and I couldn't get a new one.", "I travel 3-5 days per week in my job and end up using many different computers.", "It installed easily and worked flawlessly in my Dell Computer.", "It's a USB transfer device that acts like a little computer and will transfer files from one USB device to another.", "The Jornada basically fulfills the desire I've had for some kind of portable computer.", "They are basically the same, BUT...-The screen is about 1/2 as think as the original \"XBRITE\" screens-The power supply is about 1/2 the size of the previous generation VAIO notebooks-This computer is no where near as hot or noisyOverall, I purchased this computer to take to class everyday and my old computer was just too heavy at ~11 lbs.", "An input jack so you can also use the speakers to output music and computer sounds from a desktop or enhance the quality of a movie played on a portable DVD player or laptop.", ";)Again, I'd highly recommend this to anyone, but I would let them know that if you want to take advantage of the wireless capabilities, you will need a wireless card for every computer.", "I have to press my ear to the computer to hear any rotational or seek activity.", "My computer does feel cooler, but it runs just as much or more.For use on a desk, this is a good cooling pad and price!", "Smart idea.As I have a laptop as my main computer for now...I use this keyboard as an add-on."], "dell": ["3 Dells and 2 home grown I built..", "If you're looking for a backpack to lug around your 17\" widescreen laptop, plus a multitude of additional gadgets and peripherals, this backpack is an excellent choice.I purchased this for my recent Dell XPS M170 acquisition to provide a safe, sturdy, and mobile transportation solution when traveling.", "They did suggest I do some upgrading of my existing Dell XPS 400 as it was over seven years old.", "I have had absolutely no problems with this drive and I'm working on a Dell laptop set up as a desktop.", "Frankly, this configuration probably ensures that the Antec fans and DELL M6300 fans work to help each other.", "My laptop is a Dell inspiron 5100 and it's cooling system is a piece of garbage.", "I bought this for my 12\" Dell notebook, but the side stuck out by one and a half inches.", "I looked at a lot of manufactures for notebooks, such as Dell, HP, Toshiba, and more.", "At least twice as heavy as the OEM IBM charger, and weighs more than the IBM, Sony, and Dell chargers added together.", "Other trackpoint devices (I've used Dell and HP Compaq corporate laptops) feel \"loose\" by comparison.", "This was listed as a new powersupply for a dell laptop and was priced as such.", "Bought this for an old Dell Inspiron that had the memory go bad.", "bought this for my dad's dell inspiron laptop using the windows me platform and it installed and found all the local networks right away.", "My husband returned that one and came home with an adaptor for a PC, not a notebook and had to go back and exchange it.The router installed very smoothly on my new Dell PC.", "I just purchased one of these devices so I could use an old Dell keyboard with my newer Laptop (Windows Vista).", "I just bought the Kingston RAM to update my Dell laptop from 1GB to 2GB...", "My Dell StudioXPS 16\" system kept throttling back when playing games for extended periods.", "I am storing a 17 inch Dell Dimension 9400 in it, and it fits perfect; zippers go right around, no problems there.", "I absolutely love this bag..I use it for my Wide Screen 15.4&quot; Dell Inspiron 8600, which absolutely doesnt fit in any other backpack in the market.", "My Dell and IBM Thinkpad could recognize them, but my HP laptop couldn't.", "This bag is perfect for the new Dell 17\" laptop we bought, fits like a glove.", "It installed easily and worked flawlessly in my Dell Computer.", "On the Dell the plug goes into the back of the notebook.", "Nice simple laptop messenger bag, holds my Dell 1525 in a neoprene sleeve very well.", "I ordered this battery instead of a namebrand \"Dell\" battery, since the cost was significantly less.", "They said this frame does not work with a Dell computer.", "When it comes to games, quality headphones do the trick.The 80GB HD is a lot smaller than what I have in my Dell, but I've invested in a Lacie D2 external drive which puts me at ease when storage is a concern.With Office for Mac, I can open, edit, and save any OfficeXP file I can find.", "I got this card from Amazon about 18 months ago for my 2002 Dell Inspiron 2650, when I finally left the dial-up doldrums and got wireless DSL (base speed) in my home.", "Nice touches include a remote that tucks into the pc slot, 10 keypad, gorgeous 17\" screen and solid build quality(compared to Dells).", "My Dell XPS M1330 laptop has a built-in FireWire 400 port.", "I am trying to use this KVM to switch between a Dell Laptop and Desktop.A dell standard USB optical mouse will miss about 50% of the attempted clicks.", "It's certainly as physically pretty as anything that Apple has to offer, and as far as I can tell, Sony designed this notebook to attract Apple customers (it's certainly a big style improvement over clunky Dell and IBM computers).", "After I remove it, my DELL works fine again.I also install the software to my personal X61.", "Atlast I can transfer my videos from my HC32 Sony camcorder to my laptop! Works with Toshiba & Dell laptops, not sure about others.", "I removed the Dell drivers, installed the IBM drivers and got the keyboard tweaked to perfection.", "The Feren Backpack holds my Dell Inspiron E1505, widescreen 15.4\" laptop, 3 books, a couple of folders, my wallet, pens, pencils, personal items, water bottles, and lunch.", "After reviewing offerings from Dell, Ibm, HP and IBM determined that for the money the Toshiba was the best if my budget was less than $2000.Good features: (1) speed, (2) everything works, (3) good screen; (4) very good video card, I run the native screen plus a 24\" dell monitor with no problem.Poor features: Keyboard layout is strange.", "I purchased two Orinoco Silver PC cards, one for my old G3 Powerbook (Wallstreet) and one for my daughter's Dell Latitude laptop.", "I bought two of these to upgrade my old Dell Inspiron 8600 to 2GB of RAM which only had 512MB of RAM.", "They greatly reduced the quality once they realized they were going to last forever, Dell sort of did the same thing.", "Some of the machines issued produce a high pitched whine, which if it's too troublesome, you can contact HP and exchange the laptop for a new (not refurbished one like Dell gets away with).", "I bought it for connecting my dell laptop(HDMI) to an samsung monitor(DVI).", "on my dell laptop with NT and Linux, both OSes recognize the adapter. on NT, I had to install the Softex PC card controller program downloaded from support.dell.com.", "I bought this memory for an old laptop i was given (dell inspiron 4000)Unfortunately my system would not boot.", "I'm using it with my Dell Inspiron 9300 laptop with a built-in true moble 350 bluetooth receiver.", "It works well with my Dell E1705.", "Purchased this to supplement my Dell laptop's very inadequate speakers.", "And one of the best parts? The life of the battery puts my former Dell computers to absolute shame!I had ordered another Dell with the VISTA operating system a couple of months ago.", "I am using Vista Ultimate on my Dell 1705 and 1520 laptops.", "I bought one from one of the market place sellers on amazon about 6-months ago, and it continues to work fine in My Dell C600.", "My Dell precision M70 will not boot up with the keyboard plugged in.", "Dell even replaced my heatsink, fans, and taught me how to keep it dust free (better airflow).This product only delayed the inevitable crash though, and here's the major flaw.", "If you have larger notebooks, I guess it is not going to fit that easily especially if it is thick - like Toshiba and dell brands.", "This is my third battery for my 2004 (antique?!) Dell Inspiron.", "Worked great connecting my Dell Windows XP laptop to Garmin GPS72.", "I mostly use my laptop propped in my lap in bed,and the fans on my Dell don't go off nearly as often when I'm using the Xpad.", "It fits my Dell D600 laptop with no problem, along with room for many other items.", "I had to return this bag; my 17in Dell laptop would not fit in it.", "This memory was not specifically rated for a Dell laptop but was much cheaper than the one that was.", "No problems waking up the Dell after shutting the lid overnight.The Buffalo router seems like a solid product, other than the problem I have with the SMC wireless network card, the client IP address reporting bug, and the AOSS behavior.I am undecided wrt trying these third party firmware offerings such as DD-WRT or Tomato.", "I was told it does not work for the dell 700/710m laptops.", "now i have read reviews about dells and belin routers not getting along.", "It just won't charge.Went to Dell's site and bought an original...the original works PERFECTLY.Bought a different OEM battery and it also works well...", "I even tried a desktop eMachine and a Dell desktop, and neither of them will recognize it either.", "Whatever paint is on the unit, the plastic bumps will NOT stick to even after using the original adhesive backing, (which has stuck to my Dell for years) contact cement, and super glue.", "But the low speed is quiet, holds my Dell lapop securely and drops temps by a measured 8-10 degrees (high would do more but it is loud).", "Using this bag for an old Dell D400.", "In an actual event, my friend accidently dropped the bag with laptop inside, my Dell Inspiron 8600 was intact and was preserved by the bag.", "I went through all the Sunday ads and specials, went to Dells website, and then compared their prices and features to Apple's Macbook line.", "Have it working with a Dell Inspiron 9400 and HP Pavilion laptop, Canon Pixma Pro9000 and DLink 2XR 108G MIMO Wireless Router.", "I had an expensive company Dell that literally smoked its motherboard while I was working with it.", "Battery performs much better than the factory model from Dell.", "If you were to buy a Dell with the same scymatics as this laptop, you would easily pay double.", "So far this one, which arrived the next day and another work perfectly on my old dell 755 running windows 7 32 bit, my dell optra 745 running XP and my newer HP laptop g6 running windows 7 64 bit.", "The battery is clearly not a Dell battery.", "However, upon reboot my Dell XPS laptop (running Vista) does not recognize the VGA driver.I called Kensington for support on this issue.", "I loaded pictures for my Sisterinlaw on the 7\" fine from desktop computer, would not be reconized by my dell laptop.", "Although the title says \"Original Dell,\" this product is NOT manufactured or endorsed by Dell.", "I do get a full charge and the battery last just as long as my Dell battery.", "While I will agree somewhat that the keys feel a little different from the factory Dell piece, it doesn't make it any different to type on.", "Not as good as Dell's.2) Maximum memory is listed at 384 MB.", "Yes it does cost a lot compared to a similarly equipped Dell.", "Before buying this cooler, my laptop fan would turn on periodically throughout the day and it's really loud (Dell XPS m1730).Since having this cooler plugged in and on low, my laptop fan hasn't turned on even once - bear in mind I'm in the Caribbean, it's hot, and I'm not in an AC environment.", "Recently the Dell USB mouse I had been using with this switch began to fail and I opted to replace it with a bare bones Logitech M100 mouse.", "The unreliability was a problem.I personally didn't think the fan was loud at all (It made a quiet whirring sound, although too loud for quiet library use), and I didn't have connectivity issues.Overall, it cooled my 17inch Dell very well and I would recommend this for people who need a laptop cooler for a home office.", "When the Dell also failed to accept it, I concluded that this one was no good.", "I bought dell Inspiron 6000, and had to call countless times during past 3 years.", "My Dell XPS 1330 (with 6 cell battery) fits perfectly.", "It held my Dell XPS 1530 (with 15.4 inch screen), an AC adapter, and a mouse without any problems.", "The CLN5 is outstanding and it goes very well with my Dell Inspiron 5100 which I just acquired.", "I have had a wireless home network for several years now, the first incarnation coming along with the advent of 802.11G technology and at this point I have several different \"generations\" of technology represented within my network.I still have my first D-Link desktop card, a newer Dell laptop with a G card installed.", "We (she, me, Dell) could not get it to sync with her Sony laptop.", "I love has easy it is to use and the color is beautiful, it matches my Dell mini laptop perfectly.", "i had 512mb on my dell.", "I have 3 laptops and 1 DELL GX620 desktop and all of them have Gigabit connection.", "I really needed the RAM upgrade asap because I was going to travel so I opened up the Dell and switched one of the 2GB modules into the HP.", "I personally have a 700m laptop that attests to the endless phone calls that occur with a defective Dell.(3) The m8120n does *not* have a 300GHz power supply, it has a 350 watt power supply.", "It makes my Dell Inspirion look like a piece of garbage.The only 2 minor complaints I have are: the bottom can get a little toasty while sitting in your lap and my dvd/cd drive is a little noisey.", "I initially bought it for my 4-year-old Dell PC laptop, which would overheat quickly since it works so hard just to function normally.", "I've just gotten a E1705 Dell laptop - it's got a 17\" screen and is significantly larger than my last machine."], "service": ["The message beeps twice and tells you to contact service if it persists.", "AS FOR THE SERVICE OF AMAZON, NOTHING SHORT OF EXCELLENT, I RECEIVED MY ORDER ON TIME AND IN PERFECT CONDITION.", "Then after sitting there over night, I turned it on this morning and got \"operating system not found\".Sure glad I bought a service agreement.", "Needless to say, I have this unit in service and am somewhat satisfied with its performance.", "I bought the XL version of this bag back for my 17\" Mac notebook five (maybe more?) years ago, and I've been very happy both with the bag itself and with the service from BBP.I often carry quite a bit in the bag, both in terms of computer equipment and books/papers/whatnot.", "Spent almost a hundred dollars for shipping both ways, and service fulfillment was the worst.", "I was pleased with the service.", "Excellent communication and customer service.", "waiting for ADSL service to get activitated and then the whole place will be surfing! i plugged in my desktop, work laptop, and mac and bam, instand network.", "I was very pleased with the great service and the item itself.", "I called the customer service number.", "They do have users e-mail addresses and could easily have sent out the firmware update information that is necessary after XP service pack 2 is installed.", "I set it up on a patching Time warner Cable service that it notorious to have problems itself.", "HP has the WORST customer service of any company of any kind that I have ever dealt with.", "Customer service is excellent, also.", "Morons.This doesn't put anyone's life in danger, but it might make it dangerous for anyone standing next to you when you realize you just dropped $130 on a really nice paper weight.In all fairness, look at it this way - Amazon has excellent customer service and a great return policy.", "I called up customer service, and the guy made me feel like I did something wrong.", "With the comfort, ease of use, and the reliability, warranty and service provided by Logitech, you can't go wrong with the MX610.There is one very small issue I have with this mouse.", "I talked with two people in customer service and they told me there was nobody else to talk with \"NO returns after 15 days\" \"They will just fix it and send it back\"I am so disappointed with Gateway.", "After my last tech support tech's manager determined that I have yet another defective router and I should get a new one, I was transferred to their customer service department so that they could process an RMA.", "I did try to move files from my laptop to the new computer, both HP's, but had no luck! After some goofing around I found that the laptop was a Windows,however it was only a service pack (1)one, and the cable doesn'r work with this old of a program.", "It's maddening how incompetent their service organization is.", "However if you send it in for service, you may be in big trouble.", "Also check out black viper's web site(you can google it) to disable certain windows xp services that slow down memory.", "So I called customer service who was initially helpful in the sense of calling me back on my cell phone since my \"land line\" is through Vonage and I can't very well talk on it while resetting routers.", "MS service pack 1 was also included.After 6 hours of installing the updates the laptop runs flawless, faster and rock solid and great wireless range.", "Outstanding service!", "We sent the computer in to the warranty service and they \"repaired\" it.", "The service and the experience were excellent !!!!!!!Pete Collins", "(Note: because of heavy usage, I've gone through a strap every 6 months or so on other bags).Because I like the bag, and wanted a matching strap,I called SOLO directly, pressed 1, for customer service, and recieved a service agent who took my number and address down and is shipping a new strap, free of charge.", "However, I do have some problems after I install it on my WinXp laptop due to the interference of the Wireless Zero Configuration service that comes with WinXP.", "Look for a further update.Update two-got machine today, couldn't get it to recognize my wireless router, their software did not agree with what was coming up on the small screen, I called customer service, was on the phone for an hour trying to get things to work, the lady managed to get a test page printed out, and said the problem is fixed, thank you for using Brother, hung up, and nothing works-my desktop can't print, my laptop can't print, I have no communication with the printer, and guess what? I called back and the office is closed.", "I hope it doesn't break because I've heard that Emachines service is not that great.", "Customer service is horrible.", "After years of HP anguish I have learned that there is nothing more important in an electronic device than a knowledgeable tech support service.", "Setup is a farily automated process and the installation wizard and instruction booklet will guide you through the process.The adapter lets you use a variety of different services such as internet connection sharing, ActiveSynch, file transfer, and others.", "I haven't used the Media package yet, but will check it out sometime soon.I have never had an issue with customer service or the DVR breaking down, and the unit is going on 4 years old.", "Adding insult to injury I attempted to purchase extended warranty (since there are known problems) and Toshiba refuses to sell it because extended warranty is only available in the first 6 months of service.", "I have never mistreated this computer in any way that would cause damage to it, I even bought the $70 matching protective case to keep it safe!Sony's customer service is awful and there are no authorized repair services for sony laptops so you are pretty much forced into sending the computer out to San Diego to be repaired for two weeks.", "Customer service when I called was horrible too...don't waste your money or your time!", "But I have never had a pleasant experience with laptop customer service when it is difficult to prove a hardware problem rather than a software problem.", "I asked for the express shipping (5-9 Business Days), but I received the item within 3 days! WOW! The products and service that I have received on Amazon have been second to none!", "Customer service was o.k., and the price seemed right, but...Here is the problem: the advertised spec's state a capacity of 4400 mAh.", "After trying a few things, the technical support gave me a RMA# and asked me to send the unit to its service center.", "It also incorporates additional information on Marinas and service locations.The Garmin application the charts run on, &quot;MapSource&quot; allows you to easily switch between map types.", "This rating is for the customer service received from the supplier.", "Nothing wrong.I wrote 3 e-mails to the LTB customer service.", "Toshiba has their toll free support number prominently displayed unlike Gateway that no longer has a toll free support or customer service number.I,too, found it ready to use out of the box and the wireless functionality was immediately successful on my already established home wireless setup.", "It handles .doc, .rtf, .txt, and .html files, amongst others.The ePods was originally designed with a proprietary Internet service, but it's easy to bypass the logon requirements.", "I called WD customer service and the only solution they offered me is drive replacement.", "The Linksys has performed beautifully and their Customer service guys were so helpful, quick and terrific!", "Congratulations I hope you keep this service", "It sounded good, but it's a real piss off to get such unbelieveably useless customer service from such a big company.", "Eagerly we called the \"extended\" service numbers only to find out the 3-day turnaround is 9-10 business days and you need to mail it in to them.", "It is a great device for short trips to parks and remote area where Internet service is not available.", "Once the refund was issued, I was then contacted via email by Computer Geeks pleading with me to change my negative feedback left for them regarding their faulty product and poor customer service.", "A customer service representative contacted me in attempt to remove or alter my last review.", "They even sent me a follow-up email just to confirm and give me further product information... now that's good customer service!", "I've had several friends or acquaintances, for example, who were actually fired from their jobs due to \"excessive\" amounts of shopping, job hunting, or checking their personal e-mails while using the company's network - all of which, I believe, were just convenient excuses leveled by their firms to lay these people off!After a little digging and comparing, I finally settled on the Sierra Aircard 750 and GPRS service from AT&amp;T - and I couldn't be happier! The service, which costs $80/month for unlimited access, isn't cheap.", "I like to start off by saying, this product is AWESOME! I had basic service for 12mbps, I was not getting anywhere near 12mbps.", "They weren't telling customer service.", "This little hub is a serviceable device.", "They'll do their best to get you a functioning unit, but expecting them to pay for data recovery services is ludicrous.", "It is a little oversize for the compact MacBook, but nothing dramatic and should fit most 15 inch models even better.UPDATE 4/20/10:Still going strong after a year and a half of daily service, with one problem: about a month ago the USB end of the power cord broke.", "After downloading the service patch to activate my USB ports (yes, my computer is that old), I was able to setup the card reader to my old clunker without a hitch!Even if I had a firewire port, just slipping my card into the reader is just as easy as hooking up my camera would be.", "For whatever reasosn I brought the unit the service center and they told me that I need to change the board to make the USB ports run.", "After calls to Amazon Customer Service, Microsoft and Toshiba, Toshiba finally solved the problem by letting me know that Vista already has a miriade of updates.", "Honestly, the speakers are good: the sound is clear, the size is suitable for both desktop and laptop.However, the klipsch service REALLY SUCKS! After one week use, I found the audio cable (1/8th inch mini plug cable) was defective, then I sent told this to the klipsch support by email.", "$670 total.* Even though they were giving away their own profit, they told me that they thought it would be unethical to recommend that I repair it.The service center appealed to their Toshiba rep.", "I bought a Sony VAIO thinking that Sony, being a reputable brand, would at least have good customer service just in case anything went wrong.WAS I EVER WRONG!!!!!I bought my computer at the end of last September.", "Now I have the choice of dealing with the reportedly terrible Technical Service and wait hours for an RMA, or simply ignoring the 32 k of \"bad sectors\" that ScanDisc can find in the \"system area\" of the drive.* Some of these errors were corrected by simply replacing the MP3 file with another copy, as if the file had been corrupted during transfer to the drive, despite the fact that the file size was the same.", "I contacted Toshiba customer service, and the tech concluded that there was nothing he could he, after about 15mins of talking, and gave me the address of an authorized Toshiba service provider.", "If you buy this item, buy it from tenturtles! Xcellent service!", "Excellent service.", "The geographic coverage offered by WiFi hotspots (such as Starbucks) was also insufficient - especially since I also wanted to check e-mails and shop while I waited for my kids at their sports practices or music lessons - all of which are held at locations which don't have WiFi service (or dial-up connections), of course.Lastly (and this one is key), I also wanted the ability to surf the internet at work - without being monitored by my company's MIS department - and without being blocked by the corporation's firewalls.", "Averatec product quality is inferior and their service is non-existent.", "It's securely out of the way of legs, feet, service carts, etc.", "This occurred the day after the electric company installed a Smart Meter on my gas and electric service.", "I'm on my second one now.First one, like the reports you see in rating of (1), I too thought it would be OK to leave it out in the blazing hot sun on the dash like the New-Yorker did, and it didn't like it.Well after almost 5 years of worthy service, it now needs service.", "I port forward HTTP, FTP, SSH, Oracle, and Terminal Services through to statically assigned IP addresses and everything else is making use of the routers DHCP services.", "My very old Linksys WRT54G went belly-up after many years of service, so I picked this router up last week looking forward to the nice range/speed increase.Instead, I enjoyed several days of headaches and hours spent on the phone with tech support.I did get the wired portion of the router to work fairly quickly, the wireless, well, it never worked well at all.My laptop got a fairly good connection for browsing, but I would regularly get dropped or disconnected from online games.The Xbox360, I never got to work (I could sign on to live, but disconnect within a minute)...", "I set it up easy peasy on my desktop and laptop, never did get to see how it prints though, every time I tried to print the paper jammed, I cleaned the rollers at the suggestion of customer service and still didn't work.", "In addition, their customer service is useless.", "So my plan to use the GRANDTEC to allow me to edit photos in my family room won't work, because the people look like they're standing in a front of a fun-house mirror.It's possible there is a work-around, but since GRANDTEC makes you pay long-distance charges for a call to customer service, I didn't bother to find out.", "Excellent service with product and delivery!", "The single star is for the overall experience in Windows XP Home Service Pack 2 environment.", "I then sent the laptop back to Toshiba for service....problem not fixed.", "And forget about service.....the \"chat technicion\" didn't even ask what my problem was before trying to get me to download router configuration instructions.", "No questions asked, no proof of purchase, just good old customer service.", "This monitor failure problem is becoming common in this macbook pro.If you are looking for a business computer that you must depend on and need prompt service for - don't look for a mac.", "I found this out (before purchasing from Amazon) by emailing Targus Customer Service.", "HP Customer Service; awful! I spent 2.5 hours on the phone trying to resolve an issue with the printer installed on an ethernet.", "This kind of stuff fills your users with confidence in your network.I almost gave up on this piece of junk, but I found a suggestion in the Amazon reviews to disable the linksys config service and just let XP handle the connection.", "I even took a service quality survey and gave them all good reviews.Now maybe it's just me, but I'm sure some of you out there will know exactly what I'm talking about.", "whaaa???)Customer service agreed that its most likely defective and to return unit.", "I know customer service won't help based upon every else's experience with them, so I won't bother.Those of you who just purchased this printer and say that it's a real bargain and you are pleased with it, I'll give you a year before you come back to update your review and change your 5 stars to 1 star.", "I've not had to deal w/ customer service, but I've been very careful w/ the pen, too.", "As much as I love my Vaio I will not buy another one bcz there is no customer service from Sony", "Amazon asks that reviews avoid a discussion of price or availability so you have to figure those issues out for yourself.As for style and customer service, the VAIO (Sony) has it all.", "Startup takes about the same amount of time (even after turning off non essential services), but all other processes go much faster."], "screen": ["Overall, a very good layout.The lcd screen is small, but it's sharp, and you can adjust the brightness, contrast, etc.", "I tend to use a second monitor whenever possible and the dual screen functionality works very well (as it does on Windows machines as well.)", "It was a step in the right direction, but I was turned off by its tiny screen, the difficulty of navigating texts, and its lack of backlighting.Enter the Dana.", "Support asked me to connect the WAP to my laptop computer directly using an ethernet cable.They had me configure the TCP/IP v4 to the address 192.168.1.50 and then I was able to get to the config screens.", "The latter solution works OK in a pinch, but has several limitations, including the iPod's small screen, the slowness of the process, and the very narrow functionality of the interface (great for music, not quite adequate for viewing, judging, and copying photos).The Epson was designed from the ground up for duplicating digital photos (JPEG and RAW formats) on the road, a necessary task for photographers who prize their images as well as their sanity.", "I use it many hours every day, travel with it regularly, work at home and at various coffee shops, etc.The screen is excellent - and plenty bright even on battery.", "A stylus is also included.If you use the stylus to poke and scratch on the screen a lot, consider getting a screen protector.", "You can see dust accumulate on the screen easily.", "I dont think there are any laptop screens that thick anymore.I did not use the software that came with the cam.", "I only know I've depleted the unit and am running on my internal battery because I have configured the screen to dim a bit.", "but I mainly keep it plugged inAlso the parts in the corner near the screen has broke on both sides, that I had to use take to keep it together.The sound is so terrible, I can barely hear anything.I want to warn people.", "That alone was a deal-killer as it is a key function for a small laptop screen.", "However i would like to see Garmin develope a program (like SeaClear)and a transducer that could also plug into my laptop (or my laptop into the transducer) that would give me a large screen fishfinder that works off my existing garmin gps.", "When I first used this keyboard, there were a few problems with it like when I press a key, it'll register as another key [ex. press \"?\" register and comes out on screen as \".\"]", "Only different is the smaller screen and lesser video card really.", "Laptop screen is tilted back in a very normal way, i.e. slightly from 90deg.", "This PDA has almost the same specs as the more expensive Clie Models, without the larger screen and graffiti area, but you can still use software graffiti built into the os.", "This screen (Asus) is longer but not bigger.", "overall it is a nice laptop, from the clear screen to the speed.The full keypad is great and the screen is so clear when I'm playing a dvd but, the speakers doesn't have enough base.", "THE SOUND WONDERFULLY PLEASING AND THE STYLISH SPEAKERS FIT NICELY BEHIND THE LAPTOP SCREEN - WHEN NECESSARY.CALL ME A FASHIONISTA BUT I SIMPLY REFUSE TO USE THOSE CUBY-THING-A-MA-JIGS SOME PASS OFF AS SPEAKERS!", "Replaced the battery in my G4 Ibook, 14\" screen after five years.", "It is compact enough to fit into the inner pocket of my windbreaker and the AAA size batteries last about six months of moderate use.The Good -A full QWERTY interface in close to full size makes text entry and editing a lot easier than any touch screen interface I've usedIt is light and compactPairs easily with any HID profile Bluetooth device including the Nokia 5230 Nuron, Nokia 5800 XpressMusic,Nokia 6290, Nokia N78, Nokia N900, Nokia N8-00, and Nokia 808 Pureview.Long battery lifeThe Not So Good -Some frequent entries require pressing three keys to get them to show up.Punctuation behaves a bit oddly when quotes or other unusal characters come into playCAPS LOCK sometimes gets inadvertantly pressed with annoying results because the keys are very close to each other.From time to time keystrokes get lost in the buffer so \"I use the Nokia Bluetooth keyboard\" will show up as \"I ue te Noka Bluetth keybrd\" Have to slow down my typing to ensure all strokes make it to the document.", "The P-2000 downloads from memory cards much faster, and the screen display is bright, sharp and large enough (3.8\") to get a detailed view of photos.", "Make sure to hold the base down when opening and never open with the hand on the side of the screen.", "The overall picture is also pixelated, distorted, has interference \"snow,\" & this cable successfully makes my new 42\" 1080p LCD screen appear like an old Cathode Ray TV connected by an antenna.", "apart from that, the screen is crisp, good keys, and ok built-in speakers.", "After charging the battery (takes 2 hours) I turned it on, the screen is quite beautiful to behold with rich vibrant colors.", "As far as the reviewer complaining about video quality, I do agree that when I play the same video on my laptop screen verses the Lilliput screen, the laptop screen is noticeably nicer.", "I have had no problem seeing the screen.", "I highly recommend this to anyone looking for this particular of bag that are having a hard time finding something to hold a 17\" screen, especially a AR series Vaio.", "It looks good, but the backlit screen is sometimes difficult to read, especially if you have the lights low.", "It raised the iBook so the screen was comfortably at eye-level, and cleared desktop space for all the wires, USB hub, external FW drive, Palm, etc. that I have on my desk.", "Of course, the wide screen also causes you to curse the DVDs that AREN't anamorphic (e.g., Titanic).", "Screen when closed is not quite flush as one corner is slightly elevated.", "You have to protect it, otherwise the screen will ruin, i recommend a hard case.", "The screen is lower resolution but much easier for aging eyes to read.", "I absolutely love this bag..I use it for my Wide Screen 15.4&quot; Dell Inspiron 8600, which absolutely doesnt fit in any other backpack in the market.", "After the BIOS screen it would sit at the blinking underscore forever.", "I personally was new to setting up my laptop output on a TV screen.", "The screen is really great, and they had 24 months no interest plan to pay the $1350 after rebates.", "Check how much the keyboards flex, screen hinges wobble, etc.", "I have had huge problems getting the image on my laptop screen to match the image produced by my printer.", "I had gotten tired of other laptops where the screen would literally creak when I opened themFingerprint Signon: This one really makes life easier.", "Yes, it fits a small laptop with a 12\" screen...but it is a bit too tight.", "It does the job and adds a cushiony layer between my screen and my keyboard.", "Great display, the OS and the processor (200 MHz) are fast enough that when you are using the camera in movie mode, the screen renders fast and is not choppy.", "I bought this microphone for my Apple Laptop because I got tired of using the built in mic, having to stick my face right next to the tiny little hole next to the screen.", "I had a previous Targus backpack which I really liked, but my new laptop had an extra wide screen and wouldn't fit into the old one, so I ordered this XL backpack for the new one.", "With the latest update of Documents To Go I am extremely pleade to be able to bring PDA document with me for client references.BOTTOM LINE:1) the larger screen is easier to read than a smartphone.", "The Aspire 1640 series is a thoroughly practical notebook packed with high-end features, including a wide-screen display with Acer CrystalBrite Techno ... logy, integrated wireless LAN and Intel Centrino Mobile Technology.", "Sony incorporated their famous pixel-squeezing technology into this screen (similar to the Sony Clie PDAs) so the screen is crisp and sharp.", "These programs tend to run in the background and &quot;lock in&quot; your LPT settings - like that little ink monitor and other icons that like to display in your sys-tray (on the bottom right of your screen).", "They are basically the same, BUT...-The screen is about 1/2 as think as the original \"XBRITE\" screens-The power supply is about 1/2 the size of the previous generation VAIO notebooks-This computer is no where near as hot or noisyOverall, I purchased this computer to take to class everyday and my old computer was just too heavy at ~11 lbs.", "Amazon sell this with notebooks Toshiba Satellite A215-S4757 but you can use it, because it only accept notebooks with up to a 15\"screen, this mean that the notebook compartment is 13.19\"x 1.69\"x 11.81\" and you need at least 14.25\" to be used with a 15.4\"diagonal widescreen.", "The touch screen technology and built-in handwriting recognition software mean I don't have to find a surface for a mouse and I can take notes or draw figures with the stylus.", "You can notice lines on the screen after installation.", "The whole idea behind getting an integrated card is that you don't need much graphics card horsepower so you opt for a cheaper one that is also more energy efficient.Still, it is a large screen just made for your viewing pleasure at a decent price, so its not a bad PC just one that has certain obvious limitation (like lugging it around daily for example).P.S.", "Overall its solid, easy to set up, works with all messaging programs, can adapt to fit on a laptop screen, and its cheap.", "This Samsung has a bright, richly colored picture that looks like a flat screen LCD.", "The analysis system on the computer found that the screen was defective.", "I do not recommend this product if you are used to a higher quality PALM, Windows Pocket PC, or a base level Computer monitor or laptop screen.", "i am totally impressed by the beauty of the screen graphics as well.", "I bought this for my Gateway laptop with 15.4\" screen and it fit perfectly.", "On my second remote the volume controls do not work, I tried plugging the cables directly into the zune dock and then tried plugging into the top of the zune but they still do not work but I can live with it.Part of the video runs off the side of the tv screen, so any video that has subtitles might be a problem when viewing on the tv.All and all I'm happy with it so far, It dose what I wanted to do with it, I put crazy video's that I find on the internet on my zune and I can easily show them to people on the TV.", "They were kind of flat with very little bass.I was disappointed.Just by accident, I stumbled upon a checkbox in the \"Volume Control -> Advanced\" settings screen called \"PC Spk Mute\".I checked this on and the speakers were reborn.", "This product works great and was really easy to use.old HP laptop died, screen wouldn't work.", "This monitor is decently crisp and bright, even if the color depth leaves something to be desired (I was sometimes told of subtleties in an image online others could view easily but I could not until I viewed it on my laptop - yes, my laptop LCD screen was much better in this regard).But, while mine lasted ~2 years before developing serious backlight and power problems, it turns out I was luckier than most.", "It worked with a remote monitor, so the problem was obviously the laptop screen.", "Also, since the macbook screen doesn't open past 115 degrees or so, the screen ends up angled slightly downward - not the ideal viewing angle.Simple solution - raising the front of the stand about 2&#34; (I propped it up on a black laquered box I keep pens in, which already lives on my desk) perfects the screen height and viewing angle issues.Stand now makes me happy on a daily basis, and does the same for my bro and better half.", "Nice touches include a remote that tucks into the pc slot, 10 keypad, gorgeous 17\" screen and solid build quality(compared to Dells).", "(If they're sitting directly behind you, your screen will still be visible.)", "I just bought this and speed and all the features are cool, but the 15 inch screen seems a little dim and blueish compared to my Samsung Synchmaster 151S that I have sitting on my desktop.", "The uploading of detailed maps is much faster anyway when done directly to the SD memory card using an SD memory reader/writer (also about $20), which makes it mostly unnecessary to connect the GPS directly to the computer.The GPS receiver goes through 2 AA batteries in about 6 hours of use with screen continuously at full brightness.", "The card also caused windows XP to generate the blue screen of death during normal network activity.", "From my experience, most people use their laptop hooked up to an external display while at home, so the question of screen size might be a moot point, and above that make the 17\" impractical.if you need one more reason to buy the 15\" Powerbook, here it is.", "The second the screen snaps to the lower half of the laptop, it starts making the sound, and once I reposition it at a 90 degree angle the noise stops.", "All you get is the main roads so once you zoom into your neighborhood you get a blank screen.", "Yesterday morning, myHP Pavilion DV6675US 15.4-inch Entertainment Laptop (Intel Core 2 Duo Processor T7250, 4 GB RAM, 250 Hard Drive, Vista Ultimate)laptop had a Blue Screen of Death......So, bottom line - if you're needing more network range, and haven't invested too much in your current setup, I would highly suggest you consider the Airport Extreme / Airport Express combination instead.", "Not sure about the iPAQ, but the Palm does have an active-matrix screen, and the screen brightness is excellent.", "I remove the screen and it's back to normal.The other quirk is that the screen will occasionally pop out of the tab stays when I'm closing my laptop.", "I originally bought one in mid 2007 at a local Office Max, not checking its price beforehand, for $80.Even for that price, this is a great mouse, possibly the best laptop mouse out there right now.Especially for people with small hands, it's light weight and small size make it ultra-portable for on the go users.I don't really use the zoom and search features, but one key deciding factor when I bought the first mouse was the side buttons for easy web-surfing - I love the back and forward browser buttons - perfect for lazy surfers like me who hate having to scroll all the way to the upper left of the screen to go back or forward a page!And one really cool feature is that there is a slot at the bottom end of the mouse to store the USB dongle/receiver - inserting it automatically turns the mouse off to save battery usage - sweet!And I stated the price in the beginning as a comparison to how much it costs now - about $38 after a $15 rebate from Logitech - that's a steal!One minor gripe is even though its got a laser sensor and is advertised as being able to work on mirrored or reflective surfaces - not really true, doesn't work for me.Overall, its price, size, ergonomic and cool design, light weight, and portability make it one awesome mouse!", "After reviewing offerings from Dell, Ibm, HP and IBM determined that for the money the Toshiba was the best if my budget was less than $2000.Good features: (1) speed, (2) everything works, (3) good screen; (4) very good video card, I run the native screen plus a 24\" dell monitor with no problem.Poor features: Keyboard layout is strange.", "The 3M Privacy Screen works very well.", "It's got great battery life, is lightweight, has a beautiful screen, and the OS is wonderful! I highly recommend getting the 60GB hard drive and at least 512MB of RAM.", "The screen opening depends on the gap b/w the screen and the bottom part of the computer.", "On the left you see a such screen, shows calories burned, elevation, GPS accuracy and sunrise time.", "I use them on all my personal items such as my camera, camcorder screen, calculator, mp3 player screens, watches, cell phone, etc....", "I read all the other reviews and I had no problems with USB ports or the pixels on the screen.", "I'll try the mp3 in the near future.For me, this unit is a keeper.Pros: Easy to see, easy to use once I learned the system, pleasant command voice, easy to remove and install into its mount,you have a choice of using the touch screen or navigation buttons.Cons: Power-on confusing the first time I used it, trafic receiver attachment messy, I had to upgrade the firmware to bring it up to date, it corrects early version lockups reported in some of the early reviews.(no big deal to update)Update as of 12-20-06Cons and Pro addition to date: Can't use the MP3 player at the same time as navigating.", "I have a 7 pound 15.4\" screen laptop and so it just barely sits on it.", "The Zune with its large screen, multimedia features and 30gb seemed the natural choice.Right out of the box (awesome packaging) the Zune felt great.", "After a lot of looking, I found this bag which seemed, on screen, to be able to do the job.Unpacking it was impressive.", "It even made Vista blue-screen with a USB device error.", "I did a lot of research, and have been told these screens have relatively few defects.", "No smudges so far - the screen is always clean!", "The screen is beautiful.", "No more of those annoying black borders that surround a horizontal screen.2.8GHz Pentium 4 is one of the fastest processors for any laptop available, and a 64MB Radeon graphics card is good for a laptop, and 512 DDR RAM is very good for a laptop as well.THE POINT IS: all these wonderful features for such a GREAT PRICE and especially for a Sony VAIO, which generally is more expensive and Sony's reputation for laptops is very good.-The full size keyboard is nice, not as crampedDRAWBACKS:-8 pounds is considered heavy for a laptop, although you would have to spend significantly more for a weaker, lighter Centrino laptop-Battery consumption is slightly high due to it's incredible processing power.However, I feel that battery consumption is a non-issue because most of the time when you're working, there are places to plug your laptop into a wall outlet.However, I do not recommend this laptop if you're constantly moving around without being close to wall outlets or are too weak to carry this laptop.", "My faith in HP is renewed and I won't buy Palm stock until I see something more innovative than simply tacking a color screen on to the Palm III.", "In any case, I got used to it after adjusting my screen accordingly.", "It is made to fit a 15 inch laptop slid in on its side, and i assume is plenty deep enough for a 15 inch wide screen."], "monitor": ["(By default, installation puts an icon in the System Tray that allows you to easily monitor the Speed and Signal Strength, for whatever that's worth.)However, I have discovered one dead spot in my house from which the connection frequently fails.", "I tend to use a second monitor whenever possible and the dual screen functionality works very well (as it does on Windows machines as well.)", "Unlike most other LCD's (particularly laptops), the VP912b is easily viewable at pretty much ANY angle without any degradation of image quality or color.If you plan on using an LCD monitor for games or movies, there are two things you want to check: response time and brightness! With its 12ms response time, the VP912b is one of, if not THE, fastest monitors available today.", "I find this \"docking station\" pretty useless because it does not hook into an external monitor, a key peripheral when I use my laptop at home.", "You'll find USB, monitor, IEEE-1394, audio, ethernet (Intel 10/100 Pro) and modem ports only.", "Using this product, I can prop the laptop up at an angle and still type on the laptop keyboard comfortably, which raises the monitor up off the desk about 8 inches... or I can stand the laptop up completely and use an external keyboard/mouse on the desk.", "GOOD: The mStand raises my 15\" MacBook Pro to the same eye level as my 22\" LCD external monitor, has good aesthetics with or without the laptop present, acts as a heat sink, and gives me space underneath for laptop accessories such as USB hub, charger, card reader, etc.", "Got it to use a second monitor with my laptop.", "It will wake back up right away when you want to access it.The drive also monitors the pc and knows when you turn off your computer.", "I had never considered purchasing a laptop stand; it works nicely supporting my MacBook Air next to my HP 23 inch monitor.", "If you want to add additional video over a distance (USB runs better over distance than VGA), if you have a device like a low profile PC that it is difficult to add additional video cards to, if you want to add a 3rd monitor to a laptop, etc. this is the adapter for you.Make it a point to go out to DisplayLink to get the most current drivers, since the install disk is ALWAYS out of date.Great to add that 2nd monitor without opening the case.", "I bought this cable to connect my laptop to a monitor.", "My only sadness with the stand is that it positioned my laptop about an inch too high (probably because my monstrous laptop is quite a bit thicker than the intended iBook), and I've now had to prop up my second monitor to compensate.", "After visiting a store and seeking a wall full of bright, flat, bigger monitors, I knew I had to make a change.", "Bah on Linksys tech support for either not knowing or being unwilling to say they have a WLAN monitor 1.3 incompatibility problem with Windows 2000 and their own WRT54G router.I would still buy Linksys wireless-G products - their range is great, the router is inside an aluminum Airstream trailer transmitting 100+ feet to inside a house with good reception.", "After reading many reviews of 19\" LCD monitors I finally settled on the Samsung 193P as the best overall value/performance/quality choice.", "So I have to leave the laptop monitor open to \"balance\" out the weight.", "Each pixel on the dvd's LCD feels twice as big as the pixels you see on a LCD monitors.", "These programs tend to run in the background and &quot;lock in&quot; your LPT settings - like that little ink monitor and other icons that like to display in your sys-tray (on the bottom right of your screen).", "I have a Mac mini and a PC laptop for which I share a keyboard, mouse, and monitor.", "During that time, all of the devices connected to the UPS/Power Conditioning side, including the computer server, monitor, and telephone remained on for 45 minutes during the outage.", "I do not recommend this product if you are used to a higher quality PALM, Windows Pocket PC, or a base level Computer monitor or laptop screen.", "This monitor's flaws really stand out when you try and watch a movie.", "This monitor is decently crisp and bright, even if the color depth leaves something to be desired (I was sometimes told of subtleties in an image online others could view easily but I could not until I viewed it on my laptop - yes, my laptop LCD screen was much better in this regard).But, while mine lasted ~2 years before developing serious backlight and power problems, it turns out I was luckier than most.", "It worked with a remote monitor, so the problem was obviously the laptop screen.", "I wish they made the \"Gold\" for my 22\" widescreen monitor.", "My second tour there was as a First Sergeant and stationed in Central Baghdad and I was able to set it up and not move it the entire time until the monitor fried again.Now that I was lucky enough to find and purchase the very last new VGN-A290 in the US, I intend to send the older one in and have it completely refurbished.", "i needed a laptop stand to go alongside our new 24\" LED monitor.", "For the price, this is the best HDTV and Monitor.", "After reviewing offerings from Dell, Ibm, HP and IBM determined that for the money the Toshiba was the best if my budget was less than $2000.Good features: (1) speed, (2) everything works, (3) good screen; (4) very good video card, I run the native screen plus a 24\" dell monitor with no problem.Poor features: Keyboard layout is strange.", "I hooked up my netbook to my 4 year old monitor.", "Using a network monitor, I found someone could crack any password within a few hours and they were using my connection to download illegal music or video, I'm not sure which.", "I bought it for connecting my dell laptop(HDMI) to an samsung monitor(DVI).", "I guess because the laptop sees the splitter as a single device, if the TV and monitor don't share native resolutions then one or the other will suffer.", "Do not buy these if you want them for travel; all they will do is what any non sound-cancelling (like Sennheiser 250s, Bose QCs), non-dj monitoring (AKG 81s), or non sound-isolating (i.e. UE IEMs) headphones will do.", "Because I used it with a laptop, I cannot put it on the top of the monitor as a desktop.", "LOLThe only issue I have at the moment is that the Q-See \"SUPERDVR\" monitoring program is locked to 1024x768 resolution and cannot be moved around on your screen.", "I'm sure this applies to any laptop.My laptop with 15\" diagonal wide screen monitor hangs off the edges left and right a little, but the feet stay on it, and it doesn't bother me.I'm very happy with this model, and would buy it again!", "The trick is getting the blueish whites to look the same on both monitors, as well as the reddish whites, greenish whites, yellowish whites etc, etc.", "I watch HDTV a lot, but it also does a good job with regular TV broadcast (I had experience with Sony 32' Bravia which was terrible with regular TV)Sound is also very good.It fits well in the living room, since it does not look that big (speakers are hidden in the bottom)I also hooked it up to my laptop, and now I have a 40' PC monitor with wireless keyboard & mouse..", "I needed a longer cable to connect a laptop to a monitor screen in Church and this proved to be a good option.", "There was a time when monitors were square and CRTs were the end-all-be-all.", "You don't need another monitor to set up your TV to work with your computer.5.", "This stand raises my monitor to the prefect height.", "I've mainly been using this particular HDMI cable with an DVI adapter to use a large, secondary digital monitor on my laptop.", "I can hook up an auxiliary monitor without visual noise for the first time in over a year.I'm going to buy another one immediately to keep as a spare.(*) - To be fair to the other reviewers, when dealing with super inexpensive, \"Made in China\" replacements, it's not uncommon to receive the occasional bad unit.", "Software loaded easily and the Ping and monitoring features are excellent.", "I was having a hard time trying to figure out what kind of cables do I need to connect my laptop to my monitors.", "My monitor is 1920x1080.", "My monitor only comes with DVI port.", "You can adjust height, horizontal position, distance to monitor, tilt, viewing angle, and swivel (landscape/portrait).", "I now have it sitting on a desk, plugged into another monitor so I can see to type - backlight is out.", "In this mode, my machines kept running, even though my monitors are larger than the box says I should run on it.", "I was having a lot of trouble with my logitech's keyboard reception, I use my BigScreen TV as a monitor and work away from my desk (sometimes I work in bed!).The Installation is straight foward since they are using the Windows USB Human Interface Drivers.", "As you would expect from \"studio\" monitors, These products have a marvelous frequency response.", "I then tried to open the computer and found that they failed to hook the release button for the monitor back up.", "I then push a button on the monitor when I want to switch monitors.", "I am able to browse the Internet in any room of my house - well worth the extra $100 or so.I have the 12-inch monitor, but that was because Apple hadn't released the 15-inch in the new style when I made my purchase.", "It's obviously well constructed; check back for an update after I've dropped it a few times.Please note- it is not black! Maybe it's my monitor, or maybe I just didn't read the description well enough, but I thought it was black; instead, it's a darkish green color.", "The basics work fine; keyboard, mouse, speakersBut I have not been able to get the dock to support my monitor.", "Hi, I travel a lot, and recently, I've needed a transformer to deal with a couple of products that do not have variable voltage (e.g., baby monitor and baby monitor camera).", "The others (at more than 3 times the price, minimum) exhibited drop outs in record and playback audio, and had much quieter and distorted headphone outputs.Pluses for this over the others also include a smaller, lighter housing, digital (on optical) I/O, dolby 5.1 pass through on optical.minuses include a mono-only microphone input, no simultaneous digital input with analog monitoring at 44.1khz (seems fine at 48k--there's a mutually exclusive hardware switch governing this behavior).", "the price of this converter box is absolutely outrageous! if i have to spend another $300 plus on such device other than a $300 lcd monitor & a not-so-cheap laptop, the total cost for such desire simply won't justify and definitely not stronger enough to have an incentive and an urge to take out wallets paying for it.", "I have tried it with both my laptop and PC on 2 different monitors and noticed the same strange distortion.", "After that it stays on although it does drop occasionally.On XP, it drops alot more and the wlan monitor software REFUSES to load.", "Cripes, it's not that expensive an addition.How about a card reader? You've got plenty of space up front to add it.Instead of a DVI adapter, how about you just include a mini DVI to DVI cable of at least 3 feet in length? Quite a few monitors don't come with the proper cables and this means another $30 outlay.On the topic of cables, offer the option of DVI or VGA with the latter being offered for those who can't or won't upgrade to DVI.Overall, this is a sweet unit for those who either can't afford or don't need the laptop series.", "I am using this monitor with the mac mini and I love it.", "The cable itself is quite thick (7mm), so it's a bit hard to bend, but that is both good and bad, as it protects the cable more, but makes it harder to work with.This product is in use with a HP dm1z laptop feeding to an Acer 23\" monitor, pretty standard, I would think.Pros: -Low cost-Reasonable quality-Works without flaws (for about a month so far)Cons: -Stiff cable causes slight stress on the HDMI port if I am not carefulBottom line: It does it's job at a low cost, what more could you want?Side note: For those of you that have been told that cable quality matters for HDMI cables, you have been lied to.", "Provides several axes of rotation and tilt adjustment without tools, but still provides enough resistance to stay put after adjustment.Cons:-Only supports monitors up to 20 lbs.", "Excellent service.Choices (for me) flanking the DT 770 Pro 250 Ohm were theAudio-Technica ATHM50S Professional Monitor Headphones (38 Ohms)(costing less) and theBEYER DYNAMIC DT880-Pro Headphones (250 Ohms)(costing more).", "I connected my old CRT monitor, speakers, keyboard, mouse, and ethernet cable to this device.", "Nonetheless, it's very spacious and it's easy to fit all your outlets.I used to connect my LCD monitor, xbox 360, printer, external hard dive, speakers, desktop, wireless router, laptop, and PSP recharger.", "However I was monitoring one UPS with my laptop and I did NOT want to shut down the laptop since it was happily running on its internal battery (and it can outlast the UPS!!).", "I wanted to elevate the screen to standard monitor height but wanted to be able to still type.", "Going over the reviews it seems like a lot of the problems have been fixed with more current software updates (version 1.51) I use Windows 7 64 bit with dual monitors and the works really well.", "I ordered this monitor with great hesitation.", "It has 3 high speed USB 2.0 ports, A firewire port, LAN and Phone ports, a 4-card reader (can read SD cards and Sony memory sticks...both of which I have), DVD/CD-Burner, Display Monitor port, Convenient 802.11G outside on/off slide switch.", "Sometimes I forget to clean the dust from the filter but that doesn't affect the play any.I mainly use it as a second monitor for my laptop through HDMI and at the time of my purchase, it was ahead of it's technology for price ratio.", "Now, it is a bit bulky for those tiny recessed USB ports but as for the monitors that have them on the side or towers and laptops that have them pretty much flush with the side...it works great.", "These monitors have the same resolutions as the standard 20\" and 24\" respectively.", "I can't raise it too high on this riser because of the monitor angle and it starts to feel precarious.Just a word of warning (and it's difficult to do) but I recommend figuring out how much you'll want to raise your laptop before you purchase this riser.", "I use this as a second monitor for my laptop and LOVE it!", "thats my only true complaint, so i am very happy with this producti have a DVD/VCR for watching movies and TV, my 360, my laptop through VGA, and a few things through the USB ports all hooked up. and this monitor never gives me a problem.", "I ordered one cable for use with my laptop and monitor.", "My laptop loves this display as a monitor....extrememly clear/bright picture! I've also hooked my XBOX up along with their HD A/V pack and played a couple of games in 720p and even 1080i! All I can say is WOW! What most people probably don't realize about this TV is that the LCD screen is actually made by Philips/LG, so you know you're getting a high quality glass.", "Since it puts out less information, the switch might be able to refresh the whole monitor in this case at that resolution.Monitor 1: ViewSonic VX2250wm-LED Full HD 1080p.", "Everything I throw at this monitor looks good.", "this machine has done wonders, the screen size is hardly noticable since the resolution and sharpness are far better than any 14 inch monitor dell makes.", "I see why people like the Apple computers so much.Anyway, once you get it setup correctly, this monitor is awesome and amazing.", "Keep your keyboard, mouse, and monitor already plugged in so you don't have to connect and disconnect them from your laptop every time.", "The monitor is connected to his Media Center laptop and an XBOX.", "The TV/Monitor does not recognize that it is plugged into the computer, but the computer sees it as a \"Generic Monitor\" when it should be picking up more information than that.", "But the video connector only allowed the same resolution and form factor for an external monitor as the laptop screen.", "And I liked how in the background I could select one of my pics for the background even adjust the coloring on it just like how you do on your computer monitor for wallpaper.", "I wish it had a clip option for the monitor.", "Now I can switch laptops with my KVM and move a monitor into position to use just one keyboard and mouse.", "After a few more minutes, the signal to the monitor stopped completely.", "My desktop PC wasn't worth fixing; I wound up with a 17-inch monitor that had nothing to do.", "I've used this with a CRT as well as an LCD monitor w/o any problems.Come 2009 & time to USB everything.", "I like the lighted power button and the LCD Monitor is large and bright."], "laptop": ["Since it was still attached to my laptop, I had to use a dull hacksaw to remove it.", "If I remove the Logitech software the laptop returns to normal.", "There's about a million pockets on this thing, so I have places to put my laptop accesories and school supplies.", "I used it in connecting my laptop to a projector and it works fine.", "The LinkSys product IS the router so my original &quot;server&quot; PC can now be free to do other things.I have 3 connections in the house: 2 wireless connections (a remote desktop and a laptop), and a desktop physically connected to the Linksys via ethernet.", "I use a direct connect (desktop), USB network adapter (desktop), and PC card (laptop).", "This happened a couple of times for us and we literally had to pay the post office ransom to get the package from them!!Anyway, the adapter arrived safe and sound and I plugged in my Toshiba MK6409MAV hard drive from my dead Sony Vaio laptop and plugged it into the USB port and prayed.", "It can also charge your cell phone and laptop.", "Let's talk more about the \"real life\" aspects.But before I do, let me tell you my set-up:I have an external HD from Seagate that I use to store my music (in case my laptop HD crashes and I lose all my music...anyways, 40GB of HD space is a helluva lot).", "What a difference it makes having a fan under your laptop!!! I can't imagine I am particularly rough on the fan and laptop, however, after three months, the wiring just sort of came out of the fan.I miss the fan and will be buying another one.", "Pros:-Thank god! A cooling fan wide enough for my widescreen laptop!-Works effectively- The angled front is a VERY comfortable alternative to the other cooling mats I've tried where the laptop just sits on top.", "And all my views are as a result of seeing several laptop models and info websites, and comparing features.The IBM G-series costed more and had less features than this model (esp.", "My current laptop from Averatec has the same keyboard, sort of a tad wider, flatter key pads than normal.", "In the rest of the backpack I carry:~ Motion Computing LE1600 tablet PC with an extra battery, and an external CDR/DVD drive (this all fits in the laptop compartment.)~ Canon SD630 (my compact poin-and-shoot camera, which fits in the external zippered pocket.)~ Memory card wallet, card reader, extra camera batteries, writing pad, pens, various cables, lens caps, headphones, cleaning cloths, mini tripod, camera remote, 3 enclosed laptop hardrives - all of which fit in the main compartment.Even with all of that gear, I can still manage to cram a small lunch into the backpack on days when I ride my motorcycle to work!The straps are well padded, and have the loops that allow you to attach other Lowepro accessory pouches.", "I am fully aware that I have complete control in remapping this key so that it makes sense to me, but for some reason, I've never decided to do that.I would recommend this keyboard to anyone who enjoys typing on laptop keyboards.", "The removable velvet cushion on the iLap required me to place my hands high above the laptop in a really awkward position in order to use the keyboard while lying down and using it without the cushion so I could position my hands comfortably resulted in the laptop not being stable and sliding all over the place.", "As durable if not more so than the leather laptop briefcases.", "It really needs to be contoured better so that there is NOT a stick coming out of the laptop.", "Good for blowing dust off lenses and laptop keyboards.", "We aren't using it to carry a laptop, just a lot of heavy books and stuff.", "Before that I had a Mac laptop that ran hot where the motherboard had to be replaced.", "Instead of worrying about transporting DVD or CDs, or having to rely on several USB flash drives to carry my music, TV shows and movies, the Passport provides a central location to house all my media while keeping my laptop drive free to maintain work files and apps, as well as serve as the download station before I back it up on my Passport.", "Loading the software on my Sony SZ laptop was easy but the program is huge and loaded with lots of HP extras that had minimal value for me.", "bought these to keep on my kitchen counter for use with my macbook... i wanted something that would let me hear my music or talk radio while i was wandering between the kitchen, living room and laundry room doing chores...the built-in speakers on my laptop are good but not quite loud enough.", "It's easy to install in your standard laptop PCMCIA/Cardbus slot.", "I am right-handed, but my USB ports are on the left side of my laptop.", "My only complaint about the case is that dust and debris tends to collect down in the case near the edges of the laptop.", "I needed DVD's to back-up my new Laptop Computer, and the DVD's that I got from Radio Shack did not work(OK, I got the cheap Radio Shack brand... my mistake).", "Although this device worked out of the box with my laptop, it didn't take long to run into issues with other machines.", "Overall tihs is the best, of four, laptop I've owned.", "Transfering my music library was easy; my XP and laptop had no trouble accepting it.", "NOTE: That Laptop can actually be any computer.", "Needed a good backpack for my toshiba laptop.", "Especially for laptop USB ports on the back of the machine.The enrolling limitation can be overcome somewhat if you enroll different people as different digits.", "The bottom of it is plastic and if the laptop I'm using is small enough, it's possible to use it in my lap if I arrange it so my legs aren't blocking the two fan holes on the bottom of the cooler.", "It has lots of space to carry all my laptop accessories and my 16 inch laptop fits easily.", "This happens once every 5-6 laptops start-ups/stand-by resumes.", "Unlike most other LCD's (particularly laptops), the VP912b is easily viewable at pretty much ANY angle without any degradation of image quality or color.If you plan on using an LCD monitor for games or movies, there are two things you want to check: response time and brightness! With its 12ms response time, the VP912b is one of, if not THE, fastest monitors available today.", "Speakers are adequeate, decent sound, not too loud, but reproduction is amiable for laptop speakers.", "however my friend has a laptop and he hates this because if you move the ipod around it disconnects and reconnects, which is a pain.", "This product is perfect fit into my laptop 14.1\" LCD.", "Support asked me to connect the WAP to my laptop computer directly using an ethernet cable.They had me configure the TCP/IP v4 to the address 192.168.1.50 and then I was able to get to the config screens.", "I find this \"docking station\" pretty useless because it does not hook into an external monitor, a key peripheral when I use my laptop at home.", "I use it with my laptop, and no installation is required.", "I searched for a product to record on my laptop, and this came up.", "If you're looking for a backpack to lug around your 17\" widescreen laptop, plus a multitude of additional gadgets and peripherals, this backpack is an excellent choice.I purchased this for my recent Dell XPS M170 acquisition to provide a safe, sturdy, and mobile transportation solution when traveling.", "taking my computer out at airport security no longer scares me; they almost always let me leave in in the sleeve as long as it's in a separate bin.it preserves the main advantage of a laptop-its portability-because it fits snugly around my mac and doesn't add bulk or weight.", "Quality/Looks of product: 5/5Operation of product: 5/5Overall: 5/5This an excellent laptop case.", "I recently plugged the flash drive into a late-model laptop, and the results were like night and day.", "It would then fall to the bottom of the bag and flake into tiny bits and pieces, which would then get stuck in my laptop's USB / power / other ports, causing problems with connectivity and power supply.", "Once everyone got used to my 'not a laptop' sitting on my desk, it made a great way to do homework, take notes, and even just chat while on the go or while waiting for the next class to start.", "I\"m using one laptop with a Belkin Pre-N card, also a camera and a media player both running 802.11g all with WPA2 Security.", "I have a laptop without PS/2 ports so I needed a USB hub to connect an external keyboard (MS Natural Elite) and mouse (MS Optical Wheel Mouse).", "When I use my laptop in the far corner of my house, the original linksys network is still visible as it always was, with a very low signal level.", "It was cheaper to buy it through Amazon.com even with the shipping & handling (if I had pay for it).It was so easy to pair the mouse with my laptop.", "I recently got a laptop a couple weeks ago, and while I'm starting to get used to the touchpad, let's just face it.", "The laptop was purchased for only one reason to run the DryFire USA Trap program.", "My laptop, iPad, and iPhone constantly disconnect from the Internet when connected to this router.When dropped, all devices still show that they are connected to the network, but even if I try to ping the router (192.168.0.1), no response is received.", "I had tried to install the SMC router because it was on sale at Fry's for fifty bucks, but the signal strength was low and it would not interoperate properly with my other access point (e.g. laptops connected to different APs could not see each other).", "This review is specifically for the PAUM01U Targus Ultra Mini Retractable Optical Mouse.I got this mouse because it was one of the smallest mice that I could find on the market (it's really hard to get the specific sizes on some of these travel/laptop mice - this mouse has a footprint of about 7.5 cm x 3.4 cm which is the smallest of the Ultra Mini Travel Mice in the Targus line - the other Mini Travel Mice listed by Targus are all slightly bigger).", "This is just what I wanted - a firewire plug from a camcorder to a 4 pin plug on my laptop.", "The included mouse software works well and allows for pointer movement settings different than those of the trackpad built into the desktop replacement laptop I use it on.", "Almost all of my photos are published on the web so it was perfect for quick uploads from both my company Sony laptop as well as my small travel laptop or the desktop I have at home.", "Big mistake! Out of the box, this router did not work at all with my desktop comupter; it was broadcasting a wireless connection for my laptop, but my desktop's connection was completely dead.", "Even though I've try to reset this device by pushing the reset button in the back, but it still doesn't work.After turning off for several minutes, I turned on the WRT54G again and it seems the LEDs are working correctly, but, I still can't access to internet even though my laptop has found the WRT54G but still can't connect with.", "I started with a computer (a laptop) connected to a cable modem and a printer connected to the computer.", "I bought this to use with an old laptop running Windows 98 Second Edition.", "Of course you'll have to tweak but they're manageable.I did my research before buying the laptop and quickly realized that Tech Support was lacking.", "When I plugged them into my laptop, I expected the speakers to amplify a louder volume of music compared to the stock laptop speakers and it turned out...the laptop won by a wide margin.", "Today, I have five 5-subject notebooks, 2 textbooks, my 13-inch Macbook Pro (which fits beautifully in the laptop sleeve, even with a neoprene case), charger & cord, planner, and 2 smaller textbooks in the front pocket.", "Just go for it.I am using this with a 15.4\" laptop.", "I put my laptop (with 802.11b) next to the Linksys and played the same song through both.", "If you are using this bag as a general use bag and you want a laptop and some food or a change of clothes it is nice.", "I do not have a laptop so I use this for storing my tripods pan-handle.", "I leave mine in my laptop bag for the times that I need a mouse instead of a touchpad.", "I'm buying one for my wife's laptop.", "I am the type of codehead that works on her laptop many places around the house in a single day.", "The reason I would suggest this item is because it will be with you in a travel situation- well, anywhere you bring your laptop anyway...", "To be brief, the other reviews are dead on with the portability of this laptop.", "The 17.4\" laptop fits great and is well protected.", "I like the devider that separates the laptop from the AC adapter and its cord that sit in a separate pocket.", "This case is just enough room for the laptop and cord; papers and folders; and the essentials on the inside.", "I dont think there are any laptop screens that thick anymore.I did not use the software that came with the cam.", "It would not be suitable for carrying around with your laptop, but I appreciate the solid and durable feel, which would not be the case with a light portable unit.The Plextor is a USB 2.0 device, but it is compatible with USB 1.1, which is the way I have to run it for now.", "I also have the misfortune to own the Toshiba Satellite L305D-S5895 Laptop, and the internal DVD drive in it lasted no longer than 20 hours or so before it, too, stopped working.", "I have NOT bought an \"n\" adapter card for my laptop, so all this great reception is with a \"g\" class adapter.", "I could watch TV/Tivo right away from a wireless laptop or a wired desktop in my apartment.", "I just turn my wireless off and back on on my laptop, and it reconnects and is good to go...Have learned it is worth using lithium batteries with this mouse.", "I bought this specifically to use in my truck and or travel trailer to recharge a small laptop computer, camera batteries, handheld CB radio and later a small handheld vacuum.", "I probably wouldn't use them for a laptop or computer, but they are perfect for my little MP3 player and work great.", "this was an awesome buy, plenty of room for all my needs laptop, accessories and all... love it i even fell on the ice when i was carring my laptop in its case- not a scratch or anything- it was kept perfectly safe, honestly i was surprized, but very very thankful.", "I have had absolutely no problems with this drive and I'm working on a Dell laptop set up as a desktop.", "Maybe it's because this laptop has tiny vents.", "I researched laptops for a few weeks before deciding on the av3225hs.", "Using this product, I can prop the laptop up at an angle and still type on the laptop keyboard comfortably, which raises the monitor up off the desk about 8 inches... or I can stand the laptop up completely and use an external keyboard/mouse on the desk.", "Not that big of a deal as most all of the machines I have used this on don't have support for USB 3.0 (some of the machines I work on are 17 years old!, USB 1.0, some have no USB), but it would be nice if I ever upgraded to a machine that supports 3.0 as I like seeing 50 mb/s data rates as opposed to 10-20 with 2.0.Pro's:Extremely versatileHot-swappable (no reboot required)Fits 2.5 and 3.5 laptop/desktop, PATA/IDE and SATA drives and SSD'sWorks with SATA and IDE optical drivesCan mount optical drives externallyIncludes SATA cable and Molex to SATA power adapterLighted I/O indicator and on/off switchUses standard PC power cords and SATA cablesCon's:USB cable too shortOnly supports 2TB drivesSATA cable doesn't fit snugly in the adapterWished the USB cord was mounted on the right sideInstructions were pretty vagueNo USB 3.0 compatibilityAdapter won't power on some hard drives (Seagate Barracudas mostly)This is an excellent tool.", "I don't always like lugging a laptop around, especially when my internet needs are basically limited to accessing email.", "I could not connect my blackberry 8900 to this only my laptop.", "Because of its curve shape, putting the laptop on it already allow some space for the heat to dispense.", "GOOD: The mStand raises my 15\" MacBook Pro to the same eye level as my 22\" LCD external monitor, has good aesthetics with or without the laptop present, acts as a heat sink, and gives me space underneath for laptop accessories such as USB hub, charger, card reader, etc."], "hp": ["The only unit that can compete with this one on price is the older HP Jornada 525, which is much larger, features a slower processor, serial synch, no cover, ppc 2000, and no place to store the stylus on the device.", "Loading the software on my Sony SZ laptop was easy but the program is huge and loaded with lots of HP extras that had minimal value for me.", "I'd recommend any person considering this try the keyboard (or an equivalent Compaq or HP, it's common to several) before buying it.When I looked at the accessories, the unit appeared to use a generic docking station rather than a custom-designed one as Thinkpads do.", "In addition HP and other manufactures offer accidental damage protection.", "I contacted HP Online Support, chatting with different technicians 3 separate times.", "I looked at a lot of manufactures for notebooks, such as Dell, HP, Toshiba, and more.", "I have a HP pavilion dv6700 Special Edition that I use for gaming and it cools the GPU down 10'C so now I average 40'C when idling and 50 when gaming (COD4 etc..)And amazon had a great shipping rate $3 for 1 day shipping which was great, because no retailer ( including best buy) had this cooler or a better one.Hence the cooler is made out of aluminum it naturally acts like a heat sink.", "I had never considered purchasing a laptop stand; it works nicely supporting my MacBook Air next to my HP 23 inch monitor.", "Other trackpoint devices (I've used Dell and HP Compaq corporate laptops) feel \"loose\" by comparison.", "I use it load configs onto HP switches (via Hyperterminal) as my HP Elitebook laptop does not come equipped with a serial port (DB-9).", "I have a large laptop (17\" HP DV7) and it hangs a couple inches off either side and a little off the front, so it's really designed for a machine smaller than the one I have.", "Well worth it to me.Specific to my model laptop:I used instruction (Google it) from a page labeled \"Upgrading memory on HP Pavilion zv5000 series laptops\" and it took about 10 minutes to remove and install the memory.", "The hp dv2000's are mrore substantial and you can hear the speaker.", "I'm using a DV-series HP laptop with a partition devoted to a \"recovery drive.\"", "Ended up buying a new laptop... not more HP laptops for me but that is another story.", "Maybe HP released a firmware upgrade?The key is to install using the USB Adapter on your PC first! After installed and connectivity is achieved with the printer side adapter you can access the Advanced Settings using the connectivity software.", "I personally own a *almost* brand new HP laptop less than a year old.", "I expected more from HP.", "I have an HP laserjet 4M+ and I do LAN gaming, so into the mix was added a Linksys BEFSR41 router with DHCP disabled, essentially making it a switch.", "HP ink cartridges are very overpriced and difficult to refill successfuly.", "My Dell and IBM Thinkpad could recognize them, but my HP laptop couldn't.", "I have my PDA, which fits in the side pocket, my thermos, which fits in the other side (\"water bottle\") pocket, cell phone, which goes in the frontmost, small pocket, plus my HP dv9000 series 17\" laptop, which goes in the padded compartment with inches to spare [the pocket is almost too big], dvd/cdrs, which go in the holder for those [great idea], some file folders, which go in the file compartment, and some huge books and the ac adaptor, which all fit in the other compartments.", "It would disappointed you if using it and online wireless _ unless there is another router in market using 5.8GHz (?) _ I'm using D Link DI-624 with HP zv6000 series laptop", "I discovered that the laptop would also shutdown unexpected in the middle of restoring the system software to original factory state using the HP restore CDs.", "It fits my relatively-large 15.4\" HP dv5000 notebook without the slightest problem.", "I purchased this messenger case for my HP 15.6 inch laptop three years ago.", "HP has the WORST customer service of any company of any kind that I have ever dealt with.", "I bought this to compliment my HP Business inkjet 2200 because is a wide format and it uses the same individual ink cartridges as the BIJ 2200.", "This product works great and was really easy to use.old HP laptop died, screen wouldn't work.", "First chief feature of HP z7010us is the extreme graphics it produces.", "The 17\" HP laptop is simply just too big for it.It works well, I can feel my entire laptop cooling down.", "I have attached a newer HP Desktop (Windows 7), a 2 year old Toshiba Laptop (Win7), a two year old Compaq laptop (Win7) and an ancient PentiumII eMachine (512MB RAM) Windows XP and all computers worked flawlessly out of the box with their respective USB (auto) installs.", "- The good: MSOFT and HP are almost there, this is much more palm-esque than their last try.", "When this one was repaired, HP also reformatted my hard disk, losing all my data again.", "The HP Pavillion is the first laptop that I have felt a need to have a cooler on my lap, although I have used several other brands of computers in the past.", "I'll buy either an HP or and APPLE.", "I have been an HP user for over 5 years (2 PSC devices and a laptop).", "The DVD player plays movies effortlessly and the speaker sound is undoubtedly superior to the Compaq and HP units! No problems playing a 2-hr movie on battery power so far.", "After reviewing offerings from Dell, Ibm, HP and IBM determined that for the money the Toshiba was the best if my budget was less than $2000.Good features: (1) speed, (2) everything works, (3) good screen; (4) very good video card, I run the native screen plus a 24\" dell monitor with no problem.Poor features: Keyboard layout is strange.", "This is SIGNIFICANTLY shorter than the standard cord provided with HP laptops (about 9 feet).", "Some of the machines issued produce a high pitched whine, which if it's too troublesome, you can contact HP and exchange the laptop for a new (not refurbished one like Dell gets away with).", "I did try to move files from my laptop to the new computer, both HP's, but had no luck! After some goofing around I found that the laptop was a Windows,however it was only a service pack (1)one, and the cable doesn'r work with this old of a program.", "I wanted to make my HP Laserjet1300 accessible over my network.", "My faith in HP is renewed and I won't buy Palm stock until I see something more innovative than simply tacking a color screen on to the Palm III.", "Items arrived today in official HP packaging, plugged them both into my laptop and yay! everything works perfectly.", "I got one reply that stating an estimated shipping date of 5/15/06 and a separate reply from someone else at HP with an estimation of 4/27/06.I replied that I wanted to cancel my order and to receive a reverse charge on my credit card for the parts they already sent and charged me for.", "The greedy people at HP also decided to not support network printing on this computer, thinking you should buy 1 HP printer per computer.", "I use an HP 2550L networked through the Airport Base Station to serve as my high volume (but still rather slow) printer for my all Mac network.The 3930 is used for the occasional task such as photo and detailed graphics printing.", "After subtracting space needed for creating the file system, HP's recovery partition, and Windows, you are left with just around 60gb to really use.Optical drive: the dvd burner works great, I've had no problems with it.", "I was on HP technical support for more than 4 hours and they were not able to figure it out either.", "I don't have an issue with the lack of the power supply or AC adapter because I seem to collect them, and PS aftermarket ones with the typical #2 tip which works with HP, is very common.The issue I have is that the thick cord has frayed a bit near where it attaches to the body of the Docking Station, which has made me nervous.", "I have an old HP Laserjet 6MP which has served as a workhorse for years, but when I upgraded to the new iMac with OS 10.6, Appletalk with the Assant&eacute; converter no longer worked, thus the printer couldn't work.", "Problems: too flimsy for heavy HP laptop resulting in break of plastic side vents (which caused one of the fans to stop working because of compression); but I was able to reposition the side vent and relieve the pressure off the fan and it became functional.", "My other complaint is no driver support from HP for Windows 7.", "While I wait for my \"SMC Barricade SMCWGBR14-N Draft 11n Wireless Router\" to arrive, I bought this adapter in advance to upgrade my old HP ZX5000 laptop from B to N (XP SP3).", "They work fine for my HP laptop tho.", "If I have a complaint, it is that HP does not provide wireless connectivity down into their reasonably-priced all-in-one printers.", "This was a pleasant surprise! I installed the scanner on a laptop that had Windows XP by downloading the software from the hp support site.", "My wife loves it and would touch the HP product.", "I've bought this compactflash for my pocket PC (HP Jornada 568),and use it for MP3 files.", "The Crucial PC2 5300 667Mhz DDR2 RAM I bought for my HP Pavilion works like a charm.", "I have to rest the connector on top of a pencil on my desk to get it to work properly.The HP DVD player application is crazy buggy and useless.", "I have an airport express wireless router by apple, since I have a couple mac laptops in my house, and my desktop (a hp media center m7750n) is a door down the hall.", "However, it doesn't fit HP 15.4 laptops or thicker laptops.", "Then I told them what I had done previously and what the HP technician told me and they said they don't know why they told me that (regarding the power supply) but that they are probably right.", "Most refused to listen when I told them it wasn't working and one even hung up on me! I know I was probably irate, but after 6 hours of the same problem you're bound to be pissed off.So in total I had to restore my computer completely(which was a bit of the problem, but the people at HP were awesome with the whole thing.)", "On the HP F380, all I have to do is press the copy button on top & I don't have to scan it.", "The Epson ink cartridges do NOT have new printer heads on the bottom of them, like HP and many other brands do.", "If you get this my advice is upgrade it to 2GB or order it custom built from HP with 2GB (you can get the same features or better ones if you customize the basic dv9500 and it will probably be cheaper).The regardless, though, current gaming, movie editing or other hardware intensive apps will not run on an integrated x3100.", "Got the laptop on Thu.Turned it on Friday,CPU fan failed in a few hours,called tech support,their suggestion;return it to amazon!packed it up Friday, got return authorization and took it to the UPS Store on Saturday.I'm 69 and still haven't learned;\"YOU GET WHAT YOU PAY FOR\"Ordered an HP DV1000 from HP today.GVC", "Have it working with a Dell Inspiron 9400 and HP Pavilion laptop, Canon Pixma Pro9000 and DLink 2XR 108G MIMO Wireless Router.", "The cable failed to work when connected to my HP laptop.", "The HP genes are apparent in its design and the result is pleasing.", "I bought this item for my hp pavilion laptop.", "I have a HP DV9000 laptop.", "So far this one, which arrived the next day and another work perfectly on my old dell 755 running windows 7 32 bit, my dell optra 745 running XP and my newer HP laptop g6 running windows 7 64 bit.", "I bought the original xpad for my HP tx2000 laptop...which runs very hot.", "I eventually spent another [$$$] or so for an HP print server which lets me talk to the box via Ethernet rather than USB; that solved the speed problem, but none of the other problems.- The scanning functionality just plain [is lousy].", "TAA DAA here HP comes to save the day - the QUICKDOC docking station connects (and charges) using the expansion port!!! Can you choose wisely? Back up your hard drive today dummmy!", "If the paper I feed into the feeder is wrinkled or creased in anyway, the feeder will jam up, and jam up badly.With copy machines, you can lift all of the mechanisms to pull out the paper, without ripping the paper--not with the HP 5590.", "The HP was cool, but incredibly heavy.", "I bought this especially for the new HP dv7 17\" laptop that I just got, and it just BARELY fits.", "Anyway that's a Vista thing not an HP issue.", "What this means is that you do not have to buy a new print head every time you buy new ink cartridges like you do with lexmark and HP.", "Anyway, I've really enjoyed this laptop so far for games and schoolwork and would definitely consider HP my first choice when buying off the shelf again.", "No configuring, setup, management, etc. needed.I plug the following directly into my U-verse router: my desktop computer, my HP laptop computer with docking station, an ActionTec powerline networking module which sends LAN over the outlets of my house to my LG 3D TV.", "After years of HP anguish I have learned that there is nothing more important in an electronic device than a knowledgeable tech support service.", "This Canon is much quieter than the HP was, scans at about the same speed, and allows me change settings more easily than I could with the HP.", "I need a cooler for my HP that can't keep itself cool enough on any surface.", "Tested with the following network:Comcast Cable InternetMotorola SB 5100 (Cable Modem)D-Link DIR-655 (Router)D-Link RangeBooster N DWA-642 (Adaptor)IBM Thinkpad (Laptop)Gateway PC (Personal Computer)Dish Network DVR (Digital Video Recorder)HP Media Vault MV2020 (Network Attached Storage)HP Officejet 7310 All-in-One (All-in-One Printer)Sony Playstation 3 (Gaming Console)Netgear 85 Mbps Powerline 4-Port Ethernet Adapter (Ethernet Adapter)PROS:1.", "But it doesn't fit in the case with my HP laptop so it's just extra baggage when traveling.Other buyers have given good descriptions of the notebook cooler.", "In practice you do need to keep a full set of spares on hand (six different cartridges), but the cost of ink seems reasonable compared to my experience with HP.5.", "I have used Real Player (and then didn't on advice from iRiver), HP DLA and Windows XP CD recording software at 48x, 16x, 4x and 1x speed.", "Works great over my wireless network and allows me to use the print/scan/copy features of my HP printer just as if it was connected via USB cable.I rated the item 4/5 because these advanced features are nowhere to be found in the installation manual.", "Anyhow back to HP.", "However, Socket Communications' 802.11b card DOES work in the Type I slot of the Jornada 560 series.If you're considering an iPaq so you can have extra expandability, don't - HP will provide more expansion options soon! In December 2001, you can buy a PC Card Adapter, an extended battery pack with SD/MMC slot and a mini-thumb pocket keyboard.", "THIS might be improved by downloading new drivers ... but I have yet to find someone at HP who can give me an answer about this that makes any sense.", "But getting it to work may be a challenge.I bought this card for my HP NC6000.", "HP generously provided users with USB ports galore and enough other ports (for cable modem hookup, card reader, etc.) that you don't have to worry about hubs.", "Under the 1-year warranty I then sent the unit to HP's repair facility in Memphis, Tennessee, where they replaced the battery yet again, and shipped it back."], "battery": ["Both battery die after two month.", "Battery arrived in a very timely manner.", "The only reason I am giving it a 4 star instead of a 5 is because it does not have a power button and I am worried it's going to drain the battery when I am not using it.", "Battery life is a concern.", "In the rest of the backpack I carry:~ Motion Computing LE1600 tablet PC with an extra battery, and an external CDR/DVD drive (this all fits in the laptop compartment.)~ Canon SD630 (my compact poin-and-shoot camera, which fits in the external zippered pocket.)~ Memory card wallet, card reader, extra camera batteries, writing pad, pens, various cables, lens caps, headphones, cleaning cloths, mini tripod, camera remote, 3 enclosed laptop hardrives - all of which fit in the main compartment.Even with all of that gear, I can still manage to cram a small lunch into the backpack on days when I ride my motorcycle to work!The straps are well padded, and have the loops that allow you to attach other Lowepro accessory pouches.", "It has then, turn out that the ugly sticking out of Sony T battery - serve some purpost.", "Yikes! Don't buy this battery!", "I wondered that with the size of this device why the calculator side uses a button battery.", "When you go to the FAQ it will answer silly questions like how to change the battery but has no information on substantial subjects such as wireless configuration.", "Its battery .", "the battery last for 3:30 hours and when u watch a dvd it last 1:30, so i wouldnt get this if i were a lord of the ring fan.", "I use it many hours every day, travel with it regularly, work at home and at various coffee shops, etc.The screen is excellent - and plenty bright even on battery.", "Upon powering up the CyberPower UPS I was greeted with a nice blue LCD display, which can be toggled to show current load level, estimated run time, input voltage, output voltage, output frequency, battery capacity, and the current status of the UPS (normal AC, battery in use, AVR in use, if system overload is detected, if audible sound is enabled or disabled, or if there is a household wire fault).", "They are definately the loudest of the 3 and require 2 AAA batteries to use.The Bose have great sound quality overall and good deep bass.", "It said BABBERY on the back instead of battery.", "Finally, the battery life is not significant.", "Even my recordings from the front row are very quiet.One note is that it does drain my 4th gen Nano's battery after about 2 hours of recording.", "Sometimes I wouldn't notice in time and my computer would go into \"hibernate\" because of low battery.", "When I called Logitech's store to buy a replacement battery, the rep said I had to call the tech support, since they have to be processed as warranty replacements.", "It can play videos, play games (2 included), record lectures, FM station, store pictures, text files and lasts 30 hours on a charge (haven't really tested this but I'm sure it's better than 24 hrs the new Ipod Nano is claiming).Hm, played some videos on it, and it is crystal hear, colors are nice and very fast.Possible negatives:Unlike Sandisk 270e, T9 batteries aren't exchangeable and you can't add additional memories.", "I just turn my wireless off and back on on my laptop, and it reconnects and is good to go...Have learned it is worth using lithium batteries with this mouse.", "I bought this specifically to use in my truck and or travel trailer to recharge a small laptop computer, camera batteries, handheld CB radio and later a small handheld vacuum.", "I have a Latitude D600 and right when I popped this battery in, I only had 2.5 hours of battery life.", "I only know I've depleted the unit and am running on my internal battery because I have configured the screen to dim a bit.", "Easily fits my Canon t2i, four lenses, battery pack, lens cleaner, filters, and other things.", "After setting the alarm I could not turn it off, and it would sound until I could disassemble the unit and take out the battery.", "The batteries are brand new.", "I sent it in to sony, they didnt fix it but gave me the extended battery for free, which is a 300 dollar value.", "This battery not only increases the runtime, but it raises the laptop off the table to improve airflow.", "On my Grindig Mini 300 & GE SuperRadio* I was only able to get good reception no further than the next adjoining room.With the wire extended out through the battery cover hole, I was able to get perfect reception on all my radios through the entire apartment, the attic above, & the floor below me... in a metal frame building.", "Not to mention your MP3 player, plug, batteries and CDs.", "Which also brings me to the point of the battery...the design just makes it feels cheap, it literally jiggles when you move the laptop around, I heard elsewhere on the forums that it can disconnect and the laptop would lose power, I tried to see if it would but it didn't happen to me, but I wouldn't doubt it from what I saw.In terms of battery life, there are two modes, one is \"stamina\" or long life mode which uses the onboard Intel 950 graphics chip and the other is \"power\" or performance mode and it uses the Geforce Go 7400, this is the top of the line NVIDIA chipset for the \"thin-n-light\" class of laptops.", "Replaced the battery in my G4 Ibook, 14\" screen after five years.", "The technical details section indicates this is the 6000mAh capacity battery, which I believe means it is probably 90WH.", "It is compact enough to fit into the inner pocket of my windbreaker and the AAA size batteries last about six months of moderate use.The Good -A full QWERTY interface in close to full size makes text entry and editing a lot easier than any touch screen interface I've usedIt is light and compactPairs easily with any HID profile Bluetooth device including the Nokia 5230 Nuron, Nokia 5800 XpressMusic,Nokia 6290, Nokia N78, Nokia N900, Nokia N8-00, and Nokia 808 Pureview.Long battery lifeThe Not So Good -Some frequent entries require pressing three keys to get them to show up.Punctuation behaves a bit oddly when quotes or other unusal characters come into playCAPS LOCK sometimes gets inadvertantly pressed with annoying results because the keys are very close to each other.From time to time keystrokes get lost in the buffer so \"I use the Nokia Bluetooth keyboard\" will show up as \"I ue te Noka Bluetth keybrd\" Have to slow down my typing to ensure all strokes make it to the document.", "This battery is only 2800 mAh.", "Yes, battery life could be better, but entertainment is not on my list of priorities: my instrument is a business machine.", "I pulled the protective tab from the remote battery and attempted to use the IR remote to continue the setup.", "Landscape mode makes it possible to work on spreadsheets & watch movies at a higher resolution & size.2) Memory (256Mb) & CPU speed (416 MHz)3) Functionality - I use it to watch movies, check e-mail, web-surf, edit Office documents and listen to music in addition to the Calenday, Contacts, Memos functions.4) Battery life.5) Bluetooth (BT) - easy wireless synchronization with desktop/laptop, add BT keyboard, or connect with BT phone.6) Documents To Go - allows editing of native Microsoft Word documents - very useful.Cons:1) No included Wi-Fi.", "After charging the battery (takes 2 hours) I turned it on, the screen is quite beautiful to behold with rich vibrant colors.", "Although you must forgo color, you gain a more lightweight device that is slimmer and has a much better battery life.", "The battery is a slice--i.e., it attaches to the bottom of the player and is just as wide and deep as the player, and it adds maybe half an inch to the overall height, and lots of weight.", "You could always buy a second battery too (they aren't THAT much.)", "It was about the right time to have the battery replaced.This replacement plugged in and I now have the laptop working with the same battery life it had when I bought it.", "Next, to detach the lock from my laptop I used a regular battery powered drill with a regular drill bit and drilled through the end of the lock.", "Though it may be more expensive than the \"generic\" or \"equivalent\" batteries, it is totally worth it.Sony NP-FM50 InfoLithium Battery for Select Sony Camcorders & Digital CamerasAs far as downloading pictures to your PC, it can get a bit annoying.", "My battery life is now 5 times what it was.", "I haven't had to change the batteries yet, although I take care to turn it off when not in use.", "I purchased this GPS because the GPSmap 60Csx was very expensive and the only difference is that the Csx has a barometer and a Altimeter and does instruments I have them on a Casio Pathfinder I carry with me.The 60Cx is an outstanding GPS; it records tracks, is very accurate, always locks at least 8 satellites even indoors, alkaline batteries last 30 hours +, comes with mapsource software, usb cable and with carrying accessories.", "The 800 comes with 4 rechargeable NiMH batteries and charger but only uses 2, so you can always carry a charged set with you.", "The layout is spacious, easily fitting two DSLRs with battery packs and large zoom lenses fact to face.", "Having an external status light of some form on the mouse would actually help for seeing if the thing has become distracted by the illustration on the mousepad or whatnot.Additionally, as I've discovered after months of use, the battery life isn't what it's cracked up to be, nor half as long as the Wireless Intellimouse Explorer.While I'll not suggest or admonish someone else's choice in purchasing, I will say that I purchased this mouse while it was priced substantially lower than the current price and I do not consider it a great value.", "If you really want you can replace it with a higher rated battery and get more life out of it.", "It uses two AAA batteries and battery life seems to be about the same as any other wireless mouse that I have owned or tested.", "No batteries required.", "The battery died in 15 minutes! This unit is a one-shot deal away from the outlet! That's just not going to cut it for me.USABILITY:1) There is no way of verifying the copy job,2) There is no way of seeing how much room is left,3) When the job fails (dead battery), you are stuck not knowing how much has been transferred and therefore how much you can delete from your card!FINAL ANALYSIS: It's light and cute and inexpensive.", "Overall, I have had no installation problems and the batteries last quite a while.", "One thing I noticed is for a mouse this small, it is a little dense - probablly because it requires 2 AA batteries, but its not like I have to carry the mouse and they said its supposed to last about a year, so we'll see.", "For the $30 I paid for this battery if it only lasts a year I'm still doing great - will just buy another one.", "Nor would I pay 100$ for another kb, chargeable batteries or not.", "You plug the card into your phone (under battery) and it instantly recognizes and creates directories in it (photos, music, sounds).", "when its plugged in, it will not charge.my pc says its charging but i am actually running off battery power.", "I mention this because supposedly it also knocks the battery life down from 16 hours to 11.", "Batteries quite naturally have a short shelf life, but I've never had a AC power source burn out on any appliance I've ever owned.", "But, with advanced power management features, the battery lasts about 1:45, which I consider poor for such a high-end machine.", "I ordered this battery instead of a namebrand \"Dell\" battery, since the cost was significantly less.", "I checked a few times to work with my laptop without the charger, and the battery life was quite good.", "I received the replacement laptop battery promptly, and was pleasantly surprised to see it had a higher \"mAh\" rating than the OEM battery I was replacing.", "Battery charges seem to be better than I recall with my Palm from four years ago.", "I figured that by the time you bought the wireless card and an extra battery, the prices got a lot closer.", "Whether I'm actually paying attention and taking notes, or playing *little* games (without getting caught by the teacher, of course), it works great, it's *very* compact, and the only downside is that it needs regular batteries.I can't really say how long 2 AA's last, because the college season's over and I have little use for this mouse at home on my desk (which is like 3-by-5 feet, yipee!), but when college starts up again (like I'm eager to go back) I'll buy a huge battery-bundle off of the internet or at a store (near me!), keep 2 spare ones with me, and be set.", "The best thing about this hack is that you can use your own batteries and recharge them by plugging Dana into a USB port, though you lose the ability to safely use alkaline batteries.", "So if your battery gets old, just replace it.=========This was the best price I found for a genuine replacement.", "i got this cyber power system for my internet and my linksys box and for my led tv and computer! i have all plug in and when a thunderstorms comes rolling threw it will save my linksys box from being destroy from power on and off! when you have internet stuff plug in the power seem to mess everything up! and you have to wait for awhile and fix and fix the the wireless box! so now i have this and i don't have to worry about anything no more! it will last for 90 mins on battery mode and that's enough time to wait for power to come back on and recharge if not then i get to say i turn them off safely and no more Resetting wireless box! even my computer on this cyber power to insure that everything safe! but the computer got a 40 min to last but with out tv and computer i got the internet running to the house with out power for 90 minutes which is good fr laptop and more devices so that way we can see whats going on during bad storms or hurricanes", "Any other USB device can be charged with this thing.If I'm guessing, this battery is about 2 or 3 years old.", "I leave it on accidently all the time, and I've never had to change the battery.", "The uploading of detailed maps is much faster anyway when done directly to the SD memory card using an SD memory reader/writer (also about $20), which makes it mostly unnecessary to connect the GPS directly to the computer.The GPS receiver goes through 2 AA batteries in about 6 hours of use with screen continuously at full brightness.", "This keeps my laptop completely cool at all times, and doesn't seem to drain on the battery whatsoever.", "Why would I though - it's a great computer.Battery life is pretty good - the 6 cell battery is rated at 3.5 hrs and will give you a decent 2.5.", "After using this product a few times, hoping I could get it to work, the battery meter would read 70% charged but the computer would just shut down because, in reality, it was not charged.", "The DVD player plays movies effortlessly and the speaker sound is undoubtedly superior to the Compaq and HP units! No problems playing a 2-hr movie on battery power so far.", "I originally bought one in mid 2007 at a local Office Max, not checking its price beforehand, for $80.Even for that price, this is a great mouse, possibly the best laptop mouse out there right now.Especially for people with small hands, it's light weight and small size make it ultra-portable for on the go users.I don't really use the zoom and search features, but one key deciding factor when I bought the first mouse was the side buttons for easy web-surfing - I love the back and forward browser buttons - perfect for lazy surfers like me who hate having to scroll all the way to the upper left of the screen to go back or forward a page!And one really cool feature is that there is a slot at the bottom end of the mouse to store the USB dongle/receiver - inserting it automatically turns the mouse off to save battery usage - sweet!And I stated the price in the beginning as a comparison to how much it costs now - about $38 after a $15 rebate from Logitech - that's a steal!One minor gripe is even though its got a laser sensor and is advertised as being able to work on mirrored or reflective surfaces - not really true, doesn't work for me.Overall, its price, size, ergonomic and cool design, light weight, and portability make it one awesome mouse!", "It's got great battery life, is lightweight, has a beautiful screen, and the OS is wonderful! I highly recommend getting the 60GB hard drive and at least 512MB of RAM.", "Im better off just turning off the bluetooth device unless I need it for a specific connection and saving my laptops battery.", "Don't worry the battery life is roughly a month, but when the battery approcaches the end of it's life the mouse tends to \"spaz\" out and the cursor will jump around on the screen.However, stealing the nearest AA remote battery (because I never seem to have new batteries) will fix the problem.My main complaint is the size.", "Of course, when on battery it isn't good for gaming with the CPU stepped down to below 700 MHz, but is fast enough for most anything else on battery.Sony had a problem with previous versions of their notebooks because the keypad lettering could be scratched off in normal use and the plastic housings finish rubbed off through use, something I really disliked, but this version doesn't appear to suffer from the poor design of previous versions.", "It holds a charge well so how much can I complain? I mean it is fairly inexpensive and it does fit the battery port.", "Battery packs swell when the chemistry inside starts to decompose.", "The battery was not able to be charged in my laptop.", "I'm very pleased with my purchase, but I know why its being sold for so little - battery life.", "What a deal! We brought it home and didn't have to change the batteries for about three months.", "I read others' posts about how the thumb-scroll wheel was slightly out of reach for them, but i must have intuitively learned to hold the mouse in just the right manner.I was also concerned about the battery issue; the revolution has a rechargeable battery, which i've read are expensive to replace, and requires the user to open the mouse, which may void any manufacturer's warranty.", "About a half-hour later only got around 12 emails downloaded -- what is the matter with this laptop being so slow downloading my emails -\" so I thought\" -- I then killed the email connection.In the meantime I decided to check the status of my battery because approximately an hour and a half went by.", "I bought one of these to use with my two Compaq notebooks, both at work and at home, where it shows one of it's major drawbacks, (if one is as consevative as I, in wanting to conserve batteries when not in use) the mouse, powered by two AA batteries, has NO ON/OFF SWITCH, so, when transporting between work stations, one must remove one or both batteries to shut down the unit, which otherwise remains on when not connected to the computer.", "I tested for quick hits that night by pulling the plug from the wall several times and the transition to battery power was seamless.", "No more of those annoying black borders that surround a horizontal screen.2.8GHz Pentium 4 is one of the fastest processors for any laptop available, and a 64MB Radeon graphics card is good for a laptop, and 512 DDR RAM is very good for a laptop as well.THE POINT IS: all these wonderful features for such a GREAT PRICE and especially for a Sony VAIO, which generally is more expensive and Sony's reputation for laptops is very good.-The full size keyboard is nice, not as crampedDRAWBACKS:-8 pounds is considered heavy for a laptop, although you would have to spend significantly more for a weaker, lighter Centrino laptop-Battery consumption is slightly high due to it's incredible processing power.However, I feel that battery consumption is a non-issue because most of the time when you're working, there are places to plug your laptop into a wall outlet.However, I do not recommend this laptop if you're constantly moving around without being close to wall outlets or are too weak to carry this laptop.", "This procedure provides a baseline for the processor built into the battery, so the processor can effectively regulate power consumption.", "Used it with Win 2000 and Win XP.Pros ::* Solid responsive mouse* Soft buttons* Cordless so no tangled wires around you* Optical so can be used on ( just about ) any surface* Small USB receiver* * Used it, without any issues, with my wireless internet connection* Easy to replace batteries* Single AA batteryCons ::* Might be small for a person with large hands &/or long fingers* NO carrying case.", "Also, it seems that you can only use rechargeable batteries Archos endorses.I misread the ad for this unit.", "Wireless adapter switches on/off all the time so unable to enjoy a seamless internet experience.2) Laptop appears slow, eventhough I have enough RAM, virus/malware/spyware protection, and the system has been optimized (including removal of all that unnecessary Sony junk software).3) Useless \"battery\" (if you can call it a battery).4) Touchpad is unpredictable."]}