{"doc8": ["however my friend has a laptop and he hates this because if you move the ipod around it disconnects and reconnects, which is a pain.", "I like the devider that separates the laptop from the AC adapter and its cord that sit in a separate pocket.", "Not that big of a deal as most all of the machines I have used this on don't have support for USB 3.0 (some of the machines I work on are 17 years old!, USB 1.0, some have no USB), but it would be nice if I ever upgraded to a machine that supports 3.0 as I like seeing 50 mb/s data rates as opposed to 10-20 with 2.0.Pro's:Extremely versatileHot-swappable (no reboot required)Fits 2.5 and 3.5 laptop/desktop, PATA/IDE and SATA drives and SSD'sWorks with SATA and IDE optical drivesCan mount optical drives externallyIncludes SATA cable and Molex to SATA power adapterLighted I/O indicator and on/off switchUses standard PC power cords and SATA cablesCon's:USB cable too shortOnly supports 2TB drivesSATA cable doesn't fit snugly in the adapterWished the USB cord was mounted on the right sideInstructions were pretty vagueNo USB 3.0 compatibilityAdapter won't power on some hard drives (Seagate Barracudas mostly)This is an excellent tool.", "Support asked me to connect the WAP to my laptop computer directly using an ethernet cable.They had me configure the TCP/IP v4 to the address 192.168.1.50 and then I was able to get to the config screens.", "GOOD: The mStand raises my 15\" MacBook Pro to the same eye level as my 22\" LCD external monitor, has good aesthetics with or without the laptop present, acts as a heat sink, and gives me space underneath for laptop accessories such as USB hub, charger, card reader, etc.", "It was cheaper to buy it through Amazon.com even with the shipping & handling (if I had pay for it).It was so easy to pair the mouse with my laptop.", "If I remove the Logitech software the laptop returns to normal.", "Pros:-Thank god! A cooling fan wide enough for my widescreen laptop!-Works effectively- The angled front is a VERY comfortable alternative to the other cooling mats I've tried where the laptop just sits on top.", "My laptop, iPad, and iPhone constantly disconnect from the Internet when connected to this router.When dropped, all devices still show that they are connected to the network, but even if I try to ping the router (192.168.0.1), no response is received.", "My current laptop from Averatec has the same keyboard, sort of a tad wider, flatter key pads than normal."], "doc2": ["It sounded good, but it's a real piss off to get such unbelieveably useless customer service from such a big company.", "It's securely out of the way of legs, feet, service carts, etc.", "Outstanding service!", "I bought the XL version of this bag back for my 17\" Mac notebook five (maybe more?) years ago, and I've been very happy both with the bag itself and with the service from BBP.I often carry quite a bit in the bag, both in terms of computer equipment and books/papers/whatnot.", "$670 total.* Even though they were giving away their own profit, they told me that they thought it would be unethical to recommend that I repair it.The service center appealed to their Toshiba rep.", "After my last tech support tech's manager determined that I have yet another defective router and I should get a new one, I was transferred to their customer service department so that they could process an RMA.", "HP has the WORST customer service of any company of any kind that I have ever dealt with.", "It handles .doc, .rtf, .txt, and .html files, amongst others.The ePods was originally designed with a proprietary Internet service, but it's easy to bypass the logon requirements.", "After trying a few things, the technical support gave me a RMA# and asked me to send the unit to its service center.", "And forget about service.....the \"chat technicion\" didn't even ask what my problem was before trying to get me to download router configuration instructions."], "doc3": ["I haven't had to change the batteries yet, although I take care to turn it off when not in use.", "Both battery die after two month.", "Im better off just turning off the bluetooth device unless I need it for a specific connection and saving my laptops battery.", "After using this product a few times, hoping I could get it to work, the battery meter would read 70% charged but the computer would just shut down because, in reality, it was not charged.", "I pulled the protective tab from the remote battery and attempted to use the IR remote to continue the setup.", "Batteries quite naturally have a short shelf life, but I've never had a AC power source burn out on any appliance I've ever owned.", "Whether I'm actually paying attention and taking notes, or playing *little* games (without getting caught by the teacher, of course), it works great, it's *very* compact, and the only downside is that it needs regular batteries.I can't really say how long 2 AA's last, because the college season's over and I have little use for this mouse at home on my desk (which is like 3-by-5 feet, yipee!), but when college starts up again (like I'm eager to go back) I'll buy a huge battery-bundle off of the internet or at a store (near me!), keep 2 spare ones with me, and be set.", "It uses two AAA batteries and battery life seems to be about the same as any other wireless mouse that I have owned or tested.", "Finally, the battery life is not significant.", "Any other USB device can be charged with this thing.If I'm guessing, this battery is about 2 or 3 years old."], "doc0": ["Their warranty does NOT guarantee a computer that will EVER work -- only endless repair attempts.", "I would get a error message saying I needed my cooling system repaired and then it would shut off.", "I was seriously considering buying only an ESD wrist strap to do needed repairs on a laptop when I discovered this kit.", "and that can be fixed by a &quot;repair&quot; button in windows.all in all it was worth the wait, and is very expandable.", "By the 18th month, the hard-drive crashed completely - beyond repair.", "What really bugs me is that whenever I call the support center the supposed \"expert\" has me go through repair steps I've done several times before I call them for help.", "You use a \"small\" Philips screwdriver (often included in a generic computer repair kit) to unscrew the 2 screws listed on the Dell website.", "Yet by observing these tips, you can probably make this or any laptop cooler last a long time, which in turn saves your hard-earned bucks from buying new stands, repairing laptops, and treating burns.*** Original Review (Nov 6, 2007) ***This is my first laptop cooling stand, and beforehand I've been using a 1-inch thick 3 ring binder as my laptop stand.", "Now they won't repair it anymore and effectively say \"you're on your own\".", "I got acknowledgement in couple of days and after a few weeks I got the repaired part."], "doc1": ["I see why people like the Apple computers so much.Anyway, once you get it setup correctly, this monitor is awesome and amazing.", "I was having a hard time trying to figure out what kind of cables do I need to connect my laptop to my monitors.", "thats my only true complaint, so i am very happy with this producti have a DVD/VCR for watching movies and TV, my 360, my laptop through VGA, and a few things through the USB ports all hooked up. and this monitor never gives me a problem.", "The cable itself is quite thick (7mm), so it's a bit hard to bend, but that is both good and bad, as it protects the cable more, but makes it harder to work with.This product is in use with a HP dm1z laptop feeding to an Acer 23\" monitor, pretty standard, I would think.Pros: -Low cost-Reasonable quality-Works without flaws (for about a month so far)Cons: -Stiff cable causes slight stress on the HDMI port if I am not carefulBottom line: It does it's job at a low cost, what more could you want?Side note: For those of you that have been told that cable quality matters for HDMI cables, you have been lied to.", "I've used this with a CRT as well as an LCD monitor w/o any problems.Come 2009 & time to USB everything.", "Going over the reviews it seems like a lot of the problems have been fixed with more current software updates (version 1.51) I use Windows 7 64 bit with dual monitors and the works really well.", "My second tour there was as a First Sergeant and stationed in Central Baghdad and I was able to set it up and not move it the entire time until the monitor fried again.Now that I was lucky enough to find and purchase the very last new VGN-A290 in the US, I intend to send the older one in and have it completely refurbished.", "My laptop loves this display as a monitor....extrememly clear/bright picture! I've also hooked my XBOX up along with their HD A/V pack and played a couple of games in 720p and even 1080i! All I can say is WOW! What most people probably don't realize about this TV is that the LCD screen is actually made by Philips/LG, so you know you're getting a high quality glass.", "I ordered this monitor with great hesitation.", "i needed a laptop stand to go alongside our new 24\" LED monitor."], "doc6": ["now i have read reviews about dells and belin routers not getting along.", "The battery is clearly not a Dell battery.", "It's certainly as physically pretty as anything that Apple has to offer, and as far as I can tell, Sony designed this notebook to attract Apple customers (it's certainly a big style improvement over clunky Dell and IBM computers).", "While I will agree somewhat that the keys feel a little different from the factory Dell piece, it doesn't make it any different to type on.", "This bag is perfect for the new Dell 17\" laptop we bought, fits like a glove.", "I purchased two Orinoco Silver PC cards, one for my old G3 Powerbook (Wallstreet) and one for my daughter's Dell Latitude laptop.", "I had to return this bag; my 17in Dell laptop would not fit in it.", "Have it working with a Dell Inspiron 9400 and HP Pavilion laptop, Canon Pixma Pro9000 and DLink 2XR 108G MIMO Wireless Router.", "If you're looking for a backpack to lug around your 17\" widescreen laptop, plus a multitude of additional gadgets and peripherals, this backpack is an excellent choice.I purchased this for my recent Dell XPS M170 acquisition to provide a safe, sturdy, and mobile transportation solution when traveling.", "I bought this memory for an old laptop i was given (dell inspiron 4000)Unfortunately my system would not boot."], "doc7": ["I recovered the computer and avoided the Interactual player.", "I was looking for a way to protect my laptop in that bag, rather than shop for a much more expensive dedicated computer bag.", "After the 3 hours of time spent with several technicians it is clear they are reading off a script and going down the line of problems and don't know what they are doing.UPDATE: We contacted Linksys in CA (not an easy task) and have recieved several phone calls...one apologizing for the rudeness of the technician and another from a CA tech trying to help us fix our computer.", "This product was exactly what I was looking for as a gift for my daughter who had recently purchased a 17\" laptop computer.", "For example, if you have a main LAN in one part of your house or office, and at the other end of the house/office you have a bunch of computers, printers, etc., some of which are wired together with a hub/switch and some of which are wireless (that is, you'd like to be able to take your wireless laptop around the office as you see fit, without having to be hardwired in the far part of the office), then you'll have to buy 2 of these WAP11 ver2.6 devices to put in the far office: one in Mode 2 and one in Mode 5 (which is still cheaper than stringing cable through the walls!!).I hope the above makes sense because I'm not going to scroll up to edit it.", "The video sharing program must install on the host computer.", "In my case, I was disassembling a laptop, so some of the tools cannot be used because only desktop computers require them.", "The fan is the only thing keeping this computer from melting.This is no joke.", "This can be a handy troubleshooting feature.This USB port also has a DC power jack to power it if the connected devices draw too much power from the computer it is attached to, however it does not come with a DC power supply, but so far I have not required one.It's a great buy ... you will not go wrong by getting one ... or two!", "Anyway I have been building computers for a decade now, and I LOVE this lil computer...GET ONE :)"], "doc4": ["This monitor is decently crisp and bright, even if the color depth leaves something to be desired (I was sometimes told of subtleties in an image online others could view easily but I could not until I viewed it on my laptop - yes, my laptop LCD screen was much better in this regard).But, while mine lasted ~2 years before developing serious backlight and power problems, it turns out I was luckier than most.", "Support asked me to connect the WAP to my laptop computer directly using an ethernet cable.They had me configure the TCP/IP v4 to the address 192.168.1.50 and then I was able to get to the config screens.", "but I mainly keep it plugged inAlso the parts in the corner near the screen has broke on both sides, that I had to use take to keep it together.The sound is so terrible, I can barely hear anything.I want to warn people.", "With the latest update of Documents To Go I am extremely pleade to be able to bring PDA document with me for client references.BOTTOM LINE:1) the larger screen is easier to read than a smartphone.", "It's got great battery life, is lightweight, has a beautiful screen, and the OS is wonderful! I highly recommend getting the 60GB hard drive and at least 512MB of RAM.", "The touch screen technology and built-in handwriting recognition software mean I don't have to find a surface for a mouse and I can take notes or draw figures with the stylus.", "I just bought this and speed and all the features are cool, but the 15 inch screen seems a little dim and blueish compared to my Samsung Synchmaster 151S that I have sitting on my desktop.", "Overall, a very good layout.The lcd screen is small, but it's sharp, and you can adjust the brightness, contrast, etc.", "On my second remote the volume controls do not work, I tried plugging the cables directly into the zune dock and then tried plugging into the top of the zune but they still do not work but I can live with it.Part of the video runs off the side of the tv screen, so any video that has subtitles might be a problem when viewing on the tv.All and all I'm happy with it so far, It dose what I wanted to do with it, I put crazy video's that I find on the internet on my zune and I can easily show them to people on the TV.", "I do not recommend this product if you are used to a higher quality PALM, Windows Pocket PC, or a base level Computer monitor or laptop screen."], "doc5": ["I don't have an issue with the lack of the power supply or AC adapter because I seem to collect them, and PS aftermarket ones with the typical #2 tip which works with HP, is very common.The issue I have is that the thick cord has frayed a bit near where it attaches to the body of the Docking Station, which has made me nervous.", "I contacted HP Online Support, chatting with different technicians 3 separate times.", "The HP Pavillion is the first laptop that I have felt a need to have a cooler on my lap, although I have used several other brands of computers in the past.", "I did try to move files from my laptop to the new computer, both HP's, but had no luck! After some goofing around I found that the laptop was a Windows,however it was only a service pack (1)one, and the cable doesn'r work with this old of a program.", "HP ink cartridges are very overpriced and difficult to refill successfuly.", "I have a HP DV9000 laptop.", "HP generously provided users with USB ports galore and enough other ports (for cable modem hookup, card reader, etc.) that you don't have to worry about hubs.", "I bought this item for my hp pavilion laptop.", "This was a pleasant surprise! I installed the scanner on a laptop that had Windows XP by downloading the software from the hp support site.", "My faith in HP is renewed and I won't buy Palm stock until I see something more innovative than simply tacking a color screen on to the Palm III."]}