{"battery": ["It was about the right time to have the battery replaced.This replacement plugged in and I now have the laptop working with the same battery life it had when I bought it.", "One thing I noticed is for a mouse this small, it is a little dense - probablly because it requires 2 AA batteries, but its not like I have to carry the mouse and they said its supposed to last about a year, so we'll see.", "i got this cyber power system for my internet and my linksys box and for my led tv and computer! i have all plug in and when a thunderstorms comes rolling threw it will save my linksys box from being destroy from power on and off! when you have internet stuff plug in the power seem to mess everything up! and you have to wait for awhile and fix and fix the the wireless box! so now i have this and i don't have to worry about anything no more! it will last for 90 mins on battery mode and that's enough time to wait for power to come back on and recharge if not then i get to say i turn them off safely and no more Resetting wireless box! even my computer on this cyber power to insure that everything safe! but the computer got a 40 min to last but with out tv and computer i got the internet running to the house with out power for 90 minutes which is good fr laptop and more devices so that way we can see whats going on during bad storms or hurricanes", "Also, it seems that you can only use rechargeable batteries Archos endorses.I misread the ad for this unit.", "Any other USB device can be charged with this thing.If I'm guessing, this battery is about 2 or 3 years old.", "It can play videos, play games (2 included), record lectures, FM station, store pictures, text files and lasts 30 hours on a charge (haven't really tested this but I'm sure it's better than 24 hrs the new Ipod Nano is claiming).Hm, played some videos on it, and it is crystal hear, colors are nice and very fast.Possible negatives:Unlike Sandisk 270e, T9 batteries aren't exchangeable and you can't add additional memories.", "The battery is a slice--i.e., it attaches to the bottom of the player and is just as wide and deep as the player, and it adds maybe half an inch to the overall height, and lots of weight.", "It is compact enough to fit into the inner pocket of my windbreaker and the AAA size batteries last about six months of moderate use.The Good -A full QWERTY interface in close to full size makes text entry and editing a lot easier than any touch screen interface I've usedIt is light and compactPairs easily with any HID profile Bluetooth device including the Nokia 5230 Nuron, Nokia 5800 XpressMusic,Nokia 6290, Nokia N78, Nokia N900, Nokia N8-00, and Nokia 808 Pureview.Long battery lifeThe Not So Good -Some frequent entries require pressing three keys to get them to show up.Punctuation behaves a bit oddly when quotes or other unusal characters come into playCAPS LOCK sometimes gets inadvertantly pressed with annoying results because the keys are very close to each other.From time to time keystrokes get lost in the buffer so \"I use the Nokia Bluetooth keyboard\" will show up as \"I ue te Noka Bluetth keybrd\" Have to slow down my typing to ensure all strokes make it to the document.", "In the rest of the backpack I carry:~ Motion Computing LE1600 tablet PC with an extra battery, and an external CDR/DVD drive (this all fits in the laptop compartment.)~ Canon SD630 (my compact poin-and-shoot camera, which fits in the external zippered pocket.)~ Memory card wallet, card reader, extra camera batteries, writing pad, pens, various cables, lens caps, headphones, cleaning cloths, mini tripod, camera remote, 3 enclosed laptop hardrives - all of which fit in the main compartment.Even with all of that gear, I can still manage to cram a small lunch into the backpack on days when I ride my motorcycle to work!The straps are well padded, and have the loops that allow you to attach other Lowepro accessory pouches.", "The layout is spacious, easily fitting two DSLRs with battery packs and large zoom lenses fact to face."], "computer": ["I probably wouldn't use them for a laptop or computer, but they are perfect for my little MP3 player and work great.", "Then I connected the VGA/SVGA connectors to the computers' VGA/SVGA connectors, and plugged the remaining USB ports into the computers.As an aside: one added advantage to using the device is that the keyboard and mouse signals to the computers now take only one USB port on each computer leaving another port free for some other device.I didn't install the TRENDnet driver.", "I did the same thing to my laptop and the same magic happened (I did not do any thing else, there was no need to set an IP address, no configuring the router, did not call tech support and no beating on a computer to get it to work).", "I bought this specifically to use in my truck and or travel trailer to recharge a small laptop computer, camera batteries, handheld CB radio and later a small handheld vacuum.", "I was looking for a way to protect my laptop in that bag, rather than shop for a much more expensive dedicated computer bag.", "My computer does feel cooler, but it runs just as much or more.For use on a desk, this is a good cooling pad and price!", "Unlike XP, there are never unavailable options because of your incompatible hardware, and best of all: no baloon info! When was the last time a PC user actually needed to be reminded that they had just removed their Usb Key??? Or, in case of a re-install of XP which i did more often than not, Usually an hour or so is spent making sure the OS worked with the computer as best as possible.", "That is always the downfall of the cheaper strip supressors.I read in a computer magazine a few years ago that the higher the number of joules, the better the protection.", "Also, 128 MB of RAM is downright puny in today's computing world.", "I love the computer, but had the exact same problem buying from Circuit City."], "dell": ["My Dell XPS 1330 (with 6 cell battery) fits perfectly.", "I bought this memory for an old laptop i was given (dell inspiron 4000)Unfortunately my system would not boot.", "I am using Vista Ultimate on my Dell 1705 and 1520 laptops.", "My husband returned that one and came home with an adaptor for a PC, not a notebook and had to go back and exchange it.The router installed very smoothly on my new Dell PC.", "My Dell and IBM Thinkpad could recognize them, but my HP laptop couldn't.", "I went through all the Sunday ads and specials, went to Dells website, and then compared their prices and features to Apple's Macbook line.", "Frankly, this configuration probably ensures that the Antec fans and DELL M6300 fans work to help each other.", "When it comes to games, quality headphones do the trick.The 80GB HD is a lot smaller than what I have in my Dell, but I've invested in a Lacie D2 external drive which puts me at ease when storage is a concern.With Office for Mac, I can open, edit, and save any OfficeXP file I can find.", "I loaded pictures for my Sisterinlaw on the 7\" fine from desktop computer, would not be reconized by my dell laptop.", "If you have larger notebooks, I guess it is not going to fit that easily especially if it is thick - like Toshiba and dell brands."], "hp": ["I have a HP DV9000 laptop.", "Maybe HP released a firmware upgrade?The key is to install using the USB Adapter on your PC first! After installed and connectivity is achieved with the printer side adapter you can access the Advanced Settings using the connectivity software.", "My other complaint is no driver support from HP for Windows 7.", "Have it working with a Dell Inspiron 9400 and HP Pavilion laptop, Canon Pixma Pro9000 and DLink 2XR 108G MIMO Wireless Router.", "However, it doesn't fit HP 15.4 laptops or thicker laptops.", "The DVD player plays movies effortlessly and the speaker sound is undoubtedly superior to the Compaq and HP units! No problems playing a 2-hr movie on battery power so far.", "If the paper I feed into the feeder is wrinkled or creased in anyway, the feeder will jam up, and jam up badly.With copy machines, you can lift all of the mechanisms to pull out the paper, without ripping the paper--not with the HP 5590.", "What this means is that you do not have to buy a new print head every time you buy new ink cartridges like you do with lexmark and HP.", "The only unit that can compete with this one on price is the older HP Jornada 525, which is much larger, features a slower processor, serial synch, no cover, ppc 2000, and no place to store the stylus on the device.", "I use an HP 2550L networked through the Airport Base Station to serve as my high volume (but still rather slow) printer for my all Mac network.The 3930 is used for the occasional task such as photo and detailed graphics printing."], "laptop": ["Just go for it.I am using this with a 15.4\" laptop.", "I use a direct connect (desktop), USB network adapter (desktop), and PC card (laptop).", "This product is perfect fit into my laptop 14.1\" LCD.", "I recently plugged the flash drive into a late-model laptop, and the results were like night and day.", "It would then fall to the bottom of the bag and flake into tiny bits and pieces, which would then get stuck in my laptop's USB / power / other ports, causing problems with connectivity and power supply.", "It has lots of space to carry all my laptop accessories and my 16 inch laptop fits easily.", "If I remove the Logitech software the laptop returns to normal.", "I needed DVD's to back-up my new Laptop Computer, and the DVD's that I got from Radio Shack did not work(OK, I got the cheap Radio Shack brand... my mistake).", "I researched laptops for a few weeks before deciding on the av3225hs.", "It's easy to install in your standard laptop PCMCIA/Cardbus slot."], "monitor": ["Got it to use a second monitor with my laptop.", "Unlike most other LCD's (particularly laptops), the VP912b is easily viewable at pretty much ANY angle without any degradation of image quality or color.If you plan on using an LCD monitor for games or movies, there are two things you want to check: response time and brightness! With its 12ms response time, the VP912b is one of, if not THE, fastest monitors available today.", "Cripes, it's not that expensive an addition.How about a card reader? You've got plenty of space up front to add it.Instead of a DVI adapter, how about you just include a mini DVI to DVI cable of at least 3 feet in length? Quite a few monitors don't come with the proper cables and this means another $30 outlay.On the topic of cables, offer the option of DVI or VGA with the latter being offered for those who can't or won't upgrade to DVI.Overall, this is a sweet unit for those who either can't afford or don't need the laptop series.", "Software loaded easily and the Ping and monitoring features are excellent.", "The trick is getting the blueish whites to look the same on both monitors, as well as the reddish whites, greenish whites, yellowish whites etc, etc.", "Provides several axes of rotation and tilt adjustment without tools, but still provides enough resistance to stay put after adjustment.Cons:-Only supports monitors up to 20 lbs.", "I am able to browse the Internet in any room of my house - well worth the extra $100 or so.I have the 12-inch monitor, but that was because Apple hadn't released the 15-inch in the new style when I made my purchase.", "Excellent service.Choices (for me) flanking the DT 770 Pro 250 Ohm were theAudio-Technica ATHM50S Professional Monitor Headphones (38 Ohms)(costing less) and theBEYER DYNAMIC DT880-Pro Headphones (250 Ohms)(costing more).", "Going over the reviews it seems like a lot of the problems have been fixed with more current software updates (version 1.51) I use Windows 7 64 bit with dual monitors and the works really well.", "I can hook up an auxiliary monitor without visual noise for the first time in over a year.I'm going to buy another one immediately to keep as a spare.(*) - To be fair to the other reviewers, when dealing with super inexpensive, \"Made in China\" replacements, it's not uncommon to receive the occasional bad unit."], "repair": ["We sent the computer in to the warranty service and they \"repaired\" it.", "At the time I purchased this laptop, my other laptop (an HP Pavilion ZX5240US) was in repair.", "The only way to fix it is to take it to an authorized repair center, or to send it into Toshiba.", "and that can be fixed by a &quot;repair&quot; button in windows.all in all it was worth the wait, and is very expandable.", "They were trying to charge me $795.00 to replace the LCD screen and would not do any repairs until I agreed to pay the $795.00 for the replacement of the LCD screen.", "A few days later I get this e-mail telling me the repairs would cost $279.99 so I contacted them that I had enclosed a copy of the reciept for purchase verification 4/25/2007.", "This is a well made fantastic tool kit!I got this kit for my son who just started his own computer repair business.", "USB Vacuum Cleaner/Hoover for Laptop PC Keyboard is the perfect accessory to every vertial office.A great equipment to save on GEEK repairs.", "The best part was that I was able to do the installation in about 15 minutes once I figured out where the plug-in was located on the back of the radio (found a picture of the rear of the radio in my repair manual)!", "I paid a lot of money for my Sony and I expected Sony to repair my computer without a fuss.That did not happen."], "screen": ["I do not recommend this product if you are used to a higher quality PALM, Windows Pocket PC, or a base level Computer monitor or laptop screen.", "On my second remote the volume controls do not work, I tried plugging the cables directly into the zune dock and then tried plugging into the top of the zune but they still do not work but I can live with it.Part of the video runs off the side of the tv screen, so any video that has subtitles might be a problem when viewing on the tv.All and all I'm happy with it so far, It dose what I wanted to do with it, I put crazy video's that I find on the internet on my zune and I can easily show them to people on the TV.", "Overall, a very good layout.The lcd screen is small, but it's sharp, and you can adjust the brightness, contrast, etc.", "I just bought this and speed and all the features are cool, but the 15 inch screen seems a little dim and blueish compared to my Samsung Synchmaster 151S that I have sitting on my desktop.", "The touch screen technology and built-in handwriting recognition software mean I don't have to find a surface for a mouse and I can take notes or draw figures with the stylus.", "It's got great battery life, is lightweight, has a beautiful screen, and the OS is wonderful! I highly recommend getting the 60GB hard drive and at least 512MB of RAM.", "With the latest update of Documents To Go I am extremely pleade to be able to bring PDA document with me for client references.BOTTOM LINE:1) the larger screen is easier to read than a smartphone.", "but I mainly keep it plugged inAlso the parts in the corner near the screen has broke on both sides, that I had to use take to keep it together.The sound is so terrible, I can barely hear anything.I want to warn people.", "Support asked me to connect the WAP to my laptop computer directly using an ethernet cable.They had me configure the TCP/IP v4 to the address 192.168.1.50 and then I was able to get to the config screens.", "This monitor is decently crisp and bright, even if the color depth leaves something to be desired (I was sometimes told of subtleties in an image online others could view easily but I could not until I viewed it on my laptop - yes, my laptop LCD screen was much better in this regard).But, while mine lasted ~2 years before developing serious backlight and power problems, it turns out I was luckier than most."], "service": ["After trying a few things, the technical support gave me a RMA# and asked me to send the unit to its service center.", "AS FOR THE SERVICE OF AMAZON, NOTHING SHORT OF EXCELLENT, I RECEIVED MY ORDER ON TIME AND IN PERFECT CONDITION.", "I bought a Sony VAIO thinking that Sony, being a reputable brand, would at least have good customer service just in case anything went wrong.WAS I EVER WRONG!!!!!I bought my computer at the end of last September.", "They even sent me a follow-up email just to confirm and give me further product information... now that's good customer service!", "Adding insult to injury I attempted to purchase extended warranty (since there are known problems) and Toshiba refuses to sell it because extended warranty is only available in the first 6 months of service.", "I did try to move files from my laptop to the new computer, both HP's, but had no luck! After some goofing around I found that the laptop was a Windows,however it was only a service pack (1)one, and the cable doesn'r work with this old of a program.", "I port forward HTTP, FTP, SSH, Oracle, and Terminal Services through to statically assigned IP addresses and everything else is making use of the routers DHCP services.", "Look for a further update.Update two-got machine today, couldn't get it to recognize my wireless router, their software did not agree with what was coming up on the small screen, I called customer service, was on the phone for an hour trying to get things to work, the lady managed to get a test page printed out, and said the problem is fixed, thank you for using Brother, hung up, and nothing works-my desktop can't print, my laptop can't print, I have no communication with the printer, and guess what? I called back and the office is closed.", "The geographic coverage offered by WiFi hotspots (such as Starbucks) was also insufficient - especially since I also wanted to check e-mails and shop while I waited for my kids at their sports practices or music lessons - all of which are held at locations which don't have WiFi service (or dial-up connections), of course.Lastly (and this one is key), I also wanted the ability to surf the internet at work - without being monitored by my company's MIS department - and without being blocked by the corporation's firewalls.", "This little hub is a serviceable device."]}